elua/elua/src/platform/kinetis/mk60n512md100.h
/*! \} */ /* end of group CAN_Register_Masks */


/* CAN - Peripheral instance base addresses */
/*! Peripheral CAN0 base address */
#define CAN0_BASE                                (0x40024000u)
/*! Peripheral CAN0 base pointer */
#define CAN0                                     ((CAN_Type *)CAN0_BASE)
/*! Peripheral CAN1 base address */
#define CAN1_BASE                                (0x400A4000u)
/*! Peripheral CAN1 base pointer */
#define CAN1                                     ((CAN_Type *)CAN1_BASE)

/*! \} */ /* end of group CAN_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CAU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup CAU_Peripheral_Access_Layer CAU Peripheral Access Layer */
/*! \{ */

/*! CAU - Register Layout Typedef */
typedef struct {
  __IO uint32_t CASR;                              /*!< Status Register, offset: 0x0 */
  __IO uint32_t CAA;                               /*!< Accumulator, offset: 0x4 */
  __IO uint32_t CA[9];                             /*!< General Purpose Register, array offset: 0x8, array step: 0x4 */
} CAU_Type;

/* ----------------------------------------------------------------------------
   -- CAU Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup CAU_Register_Masks CAU Register Masks */
/*! \{ */

/* CASR Bit Fields */
#define CAU_CASR_IC_MASK                         0x1u
#define CAU_CASR_IC_SHIFT                        0
#define CAU_CASR_DPE_MASK                        0x2u
#define CAU_CASR_DPE_SHIFT                       1
#define CAU_CASR_VER_MASK                        0xF0000000u
#define CAU_CASR_VER_SHIFT                       28
#define CAU_CASR_VER(x)                          (((uint32_t)(((uint32_t)(x))<<CAU_CASR_VER_SHIFT))&CAU_CASR_VER_MASK)
/* CAA Bit Fields */
#define CAU_CAA_ACC_MASK                         0xFFFFFFFFu
#define CAU_CAA_ACC_SHIFT                        0
#define CAU_CAA_ACC(x)                           (((uint32_t)(((uint32_t)(x))<<CAU_CAA_ACC_SHIFT))&CAU_CAA_ACC_MASK)
/* CA Bit Fields */
#define CAU_CA_CAn_MASK                          0xFFFFFFFFu
#define CAU_CA_CAn_SHIFT                         0
#define CAU_CA_CAn(x)                            (((uint32_t)(((uint32_t)(x))<<CAU_CA_CAn_SHIFT))&CAU_CA_CAn_MASK)

/*! \} */ /* end of group CAU_Register_Masks */


/* CAU - Peripheral instance base addresses */
/*! Peripheral CAU base address */
#define CAU_BASE                                 (0xE0081000u)
/*! Peripheral CAU base pointer */
#define CAU                                      ((CAU_Type *)CAU_BASE)

/*! \} */ /* end of group CAU_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CMT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup CMT_Peripheral_Access_Layer CMT Peripheral Access Layer */
/*! \{ */

/*! CMT - Register Layout Typedef */
typedef struct {
  __IO uint8_t CGH1;                               /*!< CMT Carrier Generator High Data Register 1, offset: 0x0 */
  __IO uint8_t CGL1;                               /*!< CMT Carrier Generator Low Data Register 1, offset: 0x1 */
  __IO uint8_t CGH2;                               /*!< CMT Carrier Generator High Data Register 2, offset: 0x2 */
  __IO uint8_t CGL2;                               /*!< CMT Carrier Generator Low Data Register 2, offset: 0x3 */
  __IO uint8_t OC;                                 /*!< CMT Output Control Register, offset: 0x4 */
  __IO uint8_t MSC;                                /*!< CMT Modulator Status and Control Register, offset: 0x5 */
  __IO uint8_t CMD1;                               /*!< CMT Modulator Data Register Mark High, offset: 0x6 */
  __IO uint8_t CMD2;                               /*!< CMT Modulator Data Register Mark Low, offset: 0x7 */
  __IO uint8_t CMD3;                               /*!< CMT Modulator Data Register Space High, offset: 0x8 */
  __IO uint8_t CMD4;                               /*!< CMT Modulator Data Register Space Low, offset: 0x9 */
  __IO uint8_t PPS;                                /*!< CMT Primary Prescaler Register, offset: 0xA */
  __IO uint8_t DMA;                                /*!< CMT Direct Memory Access, offset: 0xB */
} CMT_Type;

/* ----------------------------------------------------------------------------
   -- CMT Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup CMT_Register_Masks CMT Register Masks */
/*! \{ */

/* CGH1 Bit Fields */
#define CMT_CGH1_PH_MASK                         0xFFu
#define CMT_CGH1_PH_SHIFT                        0
#define CMT_CGH1_PH(x)                           (((uint8_t)(((uint8_t)(x))<<CMT_CGH1_PH_SHIFT))&CMT_CGH1_PH_MASK)
/* CGL1 Bit Fields */
#define CMT_CGL1_PL_MASK                         0xFFu
#define CMT_CGL1_PL_SHIFT                        0
#define CMT_CGL1_PL(x)                           (((uint8_t)(((uint8_t)(x))<<CMT_CGL1_PL_SHIFT))&CMT_CGL1_PL_MASK)
/* CGH2 Bit Fields */
#define CMT_CGH2_SH_MASK                         0xFFu
#define CMT_CGH2_SH_SHIFT                        0
#define CMT_CGH2_SH(x)                           (((uint8_t)(((uint8_t)(x))<<CMT_CGH2_SH_SHIFT))&CMT_CGH2_SH_MASK)
/* CGL2 Bit Fields */
#define CMT_CGL2_SL_MASK                         0xFFu
#define CMT_CGL2_SL_SHIFT                        0
#define CMT_CGL2_SL(x)                           (((uint8_t)(((uint8_t)(x))<<CMT_CGL2_SL_SHIFT))&CMT_CGL2_SL_MASK)
/* OC Bit Fields */
#define CMT_OC_IROPEN_MASK                       0x20u
#define CMT_OC_IROPEN_SHIFT                      5
#define CMT_OC_CMTPOL_MASK                       0x40u
#define CMT_OC_CMTPOL_SHIFT                      6
#define CMT_OC_IROL_MASK                         0x80u
#define CMT_OC_IROL_SHIFT                        7
/* MSC Bit Fields */
#define CMT_MSC_MCGEN_MASK                       0x1u
#define CMT_MSC_MCGEN_SHIFT                      0
#define CMT_MSC_EOCIE_MASK                       0x2u
#define CMT_MSC_EOCIE_SHIFT                      1
#define CMT_MSC_FSK_MASK                         0x4u
#define CMT_MSC_FSK_SHIFT                        2
#define CMT_MSC_BASE_MASK                        0x8u
#define CMT_MSC_BASE_SHIFT                       3
#define CMT_MSC_EXSPC_MASK                       0x10u
#define CMT_MSC_EXSPC_SHIFT                      4
#define CMT_MSC_CMTDIV_MASK                      0x60u
#define CMT_MSC_CMTDIV_SHIFT                     5
#define CMT_MSC_CMTDIV(x)                        (((uint8_t)(((uint8_t)(x))<<CMT_MSC_CMTDIV_SHIFT))&CMT_MSC_CMTDIV_MASK)
#define CMT_MSC_EOCF_MASK                        0x80u
#define CMT_MSC_EOCF_SHIFT                       7
/* CMD1 Bit Fields */
#define CMT_CMD1_MB_MASK                         0xFFu
#define CMT_CMD1_MB_SHIFT                        0
#define CMT_CMD1_MB(x)                           (((uint8_t)(((uint8_t)(x))<<CMT_CMD1_MB_SHIFT))&CMT_CMD1_MB_MASK)
/* CMD2 Bit Fields */
#define CMT_CMD2_MB_MASK                         0xFFu
#define CMT_CMD2_MB_SHIFT                        0
#define CMT_CMD2_MB(x)                           (((uint8_t)(((uint8_t)(x))<<CMT_CMD2_MB_SHIFT))&CMT_CMD2_MB_MASK)
/* CMD3 Bit Fields */
#define CMT_CMD3_SB_MASK                         0xFFu
#define CMT_CMD3_SB_SHIFT                        0
#define CMT_CMD3_SB(x)                           (((uint8_t)(((uint8_t)(x))<<CMT_CMD3_SB_SHIFT))&CMT_CMD3_SB_MASK)
/* CMD4 Bit Fields */
#define CMT_CMD4_SB_MASK                         0xFFu
#define CMT_CMD4_SB_SHIFT                        0
#define CMT_CMD4_SB(x)                           (((uint8_t)(((uint8_t)(x))<<CMT_CMD4_SB_SHIFT))&CMT_CMD4_SB_MASK)
/* PPS Bit Fields */
#define CMT_PPS_PPSDIV_MASK                      0xFu
#define CMT_PPS_PPSDIV_SHIFT                     0
#define CMT_PPS_PPSDIV(x)                        (((uint8_t)(((uint8_t)(x))<<CMT_PPS_PPSDIV_SHIFT))&CMT_PPS_PPSDIV_MASK)
/* DMA Bit Fields */
#define CMT_DMA_DMA_MASK                         0x1u
#define CMT_DMA_DMA_SHIFT                        0

/*! \} */ /* end of group CMT_Register_Masks */


/* CMT - Peripheral instance base addresses */
/*! Peripheral CMT base address */
#define CMT_BASE                                 (0x40062000u)
/*! Peripheral CMT base pointer */
#define CMT                                      ((CMT_Type *)CMT_BASE)

/*! \} */ /* end of group CMT_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CRC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup CRC_Peripheral_Access_Layer CRC Peripheral Access Layer */
/*! \{ */

/*! CRC - Register Layout Typedef */
typedef struct {
  __IO uint32_t CRC;                               /*!< CRC Word Register, offset: 0x0 */
  __IO uint32_t GPOLY;                             /*!< Polynomial Word Register, offset: 0x4 */
  __IO uint32_t CTRL;                              /*!< Control Register, offset: 0x8 */
} CRC_Type;

/* ----------------------------------------------------------------------------
   -- CRC Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup CRC_Register_Masks CRC Register Masks */
/*! \{ */

