elua/elua/src/platform/kinetis/mk60n512md100.h
/*! \addtogroup DMAMUX_Peripheral_Access_Layer DMAMUX Peripheral Access Layer */
/*! \{ */

/*! DMAMUX - Register Layout Typedef */
typedef struct {
  __IO uint8_t CHCFG[16];                          /*!< Channel Configuration Register, array offset: 0x0, array step: 0x1 */
} DMAMUX_Type;

/* ----------------------------------------------------------------------------
   -- DMAMUX Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup DMAMUX_Register_Masks DMAMUX Register Masks */
/*! \{ */

/* CHCFG Bit Fields */
#define DMAMUX_CHCFG_SOURCE_MASK                 0x3Fu
#define DMAMUX_CHCFG_SOURCE_SHIFT                0
#define DMAMUX_CHCFG_SOURCE(x)                   (((uint8_t)(((uint8_t)(x))<<DMAMUX_CHCFG_SOURCE_SHIFT))&DMAMUX_CHCFG_SOURCE_MASK)
#define DMAMUX_CHCFG_TRIG_MASK                   0x40u
#define DMAMUX_CHCFG_TRIG_SHIFT                  6
#define DMAMUX_CHCFG_ENBL_MASK                   0x80u
#define DMAMUX_CHCFG_ENBL_SHIFT                  7

/*! \} */ /* end of group DMAMUX_Register_Masks */


/* DMAMUX - Peripheral instance base addresses */
/*! Peripheral DMAMUX base address */
#define DMAMUX_BASE                              (0x40021000u)
/*! Peripheral DMAMUX base pointer */
#define DMAMUX                                   ((DMAMUX_Type *)DMAMUX_BASE)

/*! \} */ /* end of group DMAMUX_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- ENET Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup ENET_Peripheral_Access_Layer ENET Peripheral Access Layer */
/*! \{ */

/*! ENET - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t EIR;                               /*!< Interrupt Event Register, offset: 0x4 */
  __IO uint32_t EIMR;                              /*!< Interrupt Mask Register, offset: 0x8 */
       uint8_t RESERVED_1[4];
  __IO uint32_t RDAR;                              /*!< Receive Descriptor Active Register, offset: 0x10 */
  __IO uint32_t TDAR;                              /*!< Transmit Descriptor Active Register, offset: 0x14 */
       uint8_t RESERVED_2[12];
  __IO uint32_t ECR;                               /*!< Ethernet Control Register, offset: 0x24 */
       uint8_t RESERVED_3[24];
  __IO uint32_t MMFR;                              /*!< MII Management Frame Register, offset: 0x40 */
  __IO uint32_t MSCR;                              /*!< MII Speed Control Register, offset: 0x44 */
       uint8_t RESERVED_4[28];
  __IO uint32_t MIBC;                              /*!< MIB Control Register, offset: 0x64 */
       uint8_t RESERVED_5[28];
  __IO uint32_t RCR;                               /*!< Receive Control Register, offset: 0x84 */
       uint8_t RESERVED_6[60];
  __IO uint32_t TCR;                               /*!< Transmit Control Register, offset: 0xC4 */
       uint8_t RESERVED_7[28];
  __IO uint32_t PALR;                              /*!< Physical Address Lower Register, offset: 0xE4 */
  __IO uint32_t PAUR;                              /*!< Physical Address Upper Register, offset: 0xE8 */
  __IO uint32_t OPD;                               /*!< Opcode/Pause Duration Register, offset: 0xEC */
       uint8_t RESERVED_8[40];
  __IO uint32_t IAUR;                              /*!< Descriptor Individual Upper Address Register, offset: 0x118 */
  __IO uint32_t IALR;                              /*!< Descriptor Individual Lower Address Register, offset: 0x11C */
  __IO uint32_t GAUR;                              /*!< Descriptor Group Upper Address Register, offset: 0x120 */
  __IO uint32_t GALR;                              /*!< Descriptor Group Lower Address Register, offset: 0x124 */
       uint8_t RESERVED_9[28];
  __IO uint32_t TFWR;                              /*!< Transmit FIFO Watermark Register, offset: 0x144 */
       uint8_t RESERVED_10[56];
  __IO uint32_t RDSR;                              /*!< Receive Descriptor Ring Start Register, offset: 0x180 */
  __IO uint32_t TDSR;                              /*!< Transmit Buffer Descriptor Ring Start Register, offset: 0x184 */
  __IO uint32_t MRBR;                              /*!< Maximum Receive Buffer Size Register, offset: 0x188 */
       uint8_t RESERVED_11[4];
  __IO uint32_t RSFL;                              /*!< Receive FIFO Section Full Threshold, offset: 0x190 */
  __IO uint32_t RSEM;                              /*!< Receive FIFO Section Empty Threshold, offset: 0x194 */
  __IO uint32_t RAEM;                              /*!< Receive FIFO Almost Empty Threshold, offset: 0x198 */
  __IO uint32_t RAFL;                              /*!< Receive FIFO Almost Full Threshold, offset: 0x19C */
  __IO uint32_t TSEM;                              /*!< Transmit FIFO Section Empty Threshold, offset: 0x1A0 */
  __IO uint32_t TAEM;                              /*!< Transmit FIFO Almost Empty Threshold, offset: 0x1A4 */
  __IO uint32_t TAFL;                              /*!< Transmit FIFO Almost Full Threshold, offset: 0x1A8 */
  __IO uint32_t TIPG;                              /*!< Transmit Inter-Packet Gap, offset: 0x1AC */
  __IO uint32_t FTRL;                              /*!< Frame Truncation Length, offset: 0x1B0 */
       uint8_t RESERVED_12[12];
  __IO uint32_t TACC;                              /*!< Transmit Accelerator Function Configuration, offset: 0x1C0 */
  __IO uint32_t RACC;                              /*!< Receive Accelerator Function Configuration, offset: 0x1C4 */
       uint8_t RESERVED_13[56];
  __IO uint32_t RMON_T_DROP;                       /*!< Count of frames not counted correctly, offset: 0x200 */
  __IO uint32_t RMON_T_PACKETS;                    /*!< RMON Tx packet count, offset: 0x204 */
  __IO uint32_t RMON_T_BC_PKT;                     /*!< RMON Tx Broadcast Packets, offset: 0x208 */
  __IO uint32_t RMON_T_MC_PKT;                     /*!< RMON Tx Multicast Packets, offset: 0x20C */
  __IO uint32_t RMON_T_CRC_ALIGN;                  /*!< RMON Tx Packets w CRC/Align error, offset: 0x210 */
  __IO uint32_t RMON_T_UNDERSIZE;                  /*!< RMON Tx Packets < 64 bytes, good CRC, offset: 0x214 */
  __IO uint32_t RMON_T_OVERSIZE;                   /*!< RMON Tx Packets > MAX_FL bytes, good CRC, offset: 0x218 */
  __IO uint32_t RMON_T_FRAG;                       /*!< RMON Tx Packets < 64 bytes, bad CRC, offset: 0x21C */
  __IO uint32_t RMON_T_JAB;                        /*!< RMON Tx Packets > MAX_FL bytes, bad CRC, offset: 0x220 */
  __IO uint32_t RMON_T_COL;                        /*!< RMON Tx collision count, offset: 0x224 */
  __IO uint32_t RMON_T_P64;                        /*!< RMON Tx 64 byte packets, offset: 0x228 */
  __IO uint32_t RMON_T_P65TO127;                   /*!< RMON Tx 65 to 127 byte packets, offset: 0x22C */
  __IO uint32_t RMON_T_P128TO255;                  /*!< RMON Tx 128 to 255 byte packets, offset: 0x230 */
  __IO uint32_t RMON_T_P256TO511;                  /*!< RMON Tx 256 to 511 byte packets, offset: 0x234 */
  __IO uint32_t RMON_T_P512TO1023;                 /*!< RMON Tx 512 to 1023 byte packets, offset: 0x238 */
  __IO uint32_t RMON_T_P1024TO2047;                /*!< RMON Tx 1024 to 2047 byte packets, offset: 0x23C */
  __IO uint32_t RMON_T_P_GTE2048;                  /*!< RMON Tx packets w > 2048 bytes, offset: 0x240 */
  __IO uint32_t RMON_T_OCTETS;                     /*!< RMON Tx Octets, offset: 0x244 */
  __IO uint32_t IEEE_T_DROP;                       /*!< Count of frames not counted correctly, offset: 0x248 */
  __IO uint32_t IEEE_T_FRAME_OK;                   /*!< Frames Transmitted OK, offset: 0x24C */
  __IO uint32_t IEEE_T_1COL;                       /*!< Frames Transmitted with Single Collision, offset: 0x250 */
  __IO uint32_t IEEE_T_MCOL;                       /*!< Frames Transmitted with Multiple Collisions, offset: 0x254 */
  __IO uint32_t IEEE_T_DEF;                        /*!< Frames Transmitted after Deferral Delay, offset: 0x258 */
  __IO uint32_t IEEE_T_LCOL;                       /*!< Frames Transmitted with Late Collision, offset: 0x25C */
  __IO uint32_t IEEE_T_EXCOL;                      /*!< Frames Transmitted with Excessive Collisions, offset: 0x260 */
  __IO uint32_t IEEE_T_MACERR;                     /*!< Frames Transmitted with Tx FIFO Underrun, offset: 0x264 */
  __IO uint32_t IEEE_T_CSERR;                      /*!< Frames Transmitted with Carrier Sense Error, offset: 0x268 */
  __IO uint32_t IEEE_T_SQE;                        /*!< Frames Transmitted with SQE Error, offset: 0x26C */
  __IO uint32_t IEEE_T_FDXFC;                      /*!< Flow Control Pause frames transmitted, offset: 0x270 */
  __IO uint32_t IEEE_T_OCTETS_OK;                  /*!< Octet count for Frames Transmitted w/o Error, offset: 0x274 */
       uint8_t RESERVED_14[12];
  __IO uint32_t RMON_R_PACKETS;                    /*!< RMON Rx packet count, offset: 0x284 */
  __IO uint32_t RMON_R_BC_PKT;                     /*!< RMON Rx Broadcast Packets, offset: 0x288 */
  __IO uint32_t RMON_R_MC_PKT;                     /*!< RMON Rx Multicast Packets, offset: 0x28C */
  __IO uint32_t RMON_R_CRC_ALIGN;                  /*!< RMON Rx Packets w CRC/Align error, offset: 0x290 */
  __IO uint32_t RMON_R_UNDERSIZE;                  /*!< RMON Rx Packets < 64 bytes, good CRC, offset: 0x294 */
  __IO uint32_t RMON_R_OVERSIZE;                   /*!< RMON Rx Packets > MAX_FL bytes, good CRC, offset: 0x298 */
  __IO uint32_t RMON_R_FRAG;                       /*!< RMON Rx Packets < 64 bytes, bad CRC, offset: 0x29C */
  __IO uint32_t RMON_R_JAB;                        /*!< RMON Rx Packets > MAX_FL bytes, bad CRC, offset: 0x2A0 */
  __IO uint32_t RMON_R_RESVD_0;                    /*!< Reserved, offset: 0x2A4 */
  __IO uint32_t RMON_R_P64;                        /*!< RMON Rx 64 byte packets, offset: 0x2A8 */
  __IO uint32_t RMON_R_P65TO127;                   /*!< RMON Rx 65 to 127 byte packets, offset: 0x2AC */
  __IO uint32_t RMON_R_P128TO255;                  /*!< RMON Rx 128 to 255 byte packets, offset: 0x2B0 */
  __IO uint32_t RMON_R_P256TO511;                  /*!< RMON Rx 256 to 511 byte packets, offset: 0x2B4 */
  __IO uint32_t RMON_R_P512TO1023;                 /*!< RMON Rx 512 to 1023 byte packets, offset: 0x2B8 */
  __IO uint32_t RMON_R_P1024TO2047;                /*!< RMON Rx 1024 to 2047 byte packets, offset: 0x2BC */
  __IO uint32_t RMON_R_P_GTE2048;                  /*!< RMON Rx packets w > 2048 bytes, offset: 0x2C0 */
  __IO uint32_t RMON_R_OCTETS;                     /*!< RMON Rx Octets, offset: 0x2C4 */
  __IO uint32_t RMON_R_DROP;                       /*!< Count of frames not counted correctly, offset: 0x2C8 */
  __IO uint32_t RMON_R_FRAME_OK;                   /*!< Frames Received OK, offset: 0x2CC */
  __IO uint32_t IEEE_R_CRC;                        /*!< Frames Received with CRC Error, offset: 0x2D0 */
  __IO uint32_t IEEE_R_ALIGN;                      /*!< Frames Received with Alignment Error, offset: 0x2D4 */
  __IO uint32_t IEEE_R_MACERR;                     /*!< Receive Fifo Overflow count, offset: 0x2D8 */
  __IO uint32_t IEEE_R_FDXFC;                      /*!< Flow Control Pause frames received, offset: 0x2DC */
  __IO uint32_t IEEE_R_OCTETS_OK;                  /*!< Octet count for Frames Rcvd w/o Error, offset: 0x2E0 */
       uint8_t RESERVED_15[284];
  __IO uint32_t ATCR;                              /*!< Timer Control Register, offset: 0x400 */
  __IO uint32_t ATVR;                              /*!< Timer Value Register, offset: 0x404 */
  __IO uint32_t ATOFF;                             /*!< Timer Offset Register, offset: 0x408 */
  __IO uint32_t ATPER;                             /*!< Timer Period Register, offset: 0x40C */
  __IO uint32_t ATCOR;                             /*!< Timer Correction Register, offset: 0x410 */
  __IO uint32_t ATINC;                             /*!< Time-Stamping Clock Period Register, offset: 0x414 */
  __IO uint32_t ATSTMP;                            /*!< Timestamp of Last Transmitted Frame, offset: 0x418 */
       uint8_t RESERVED_16[488];
  __IO uint32_t TGSR;                              /*!< Timer Global Status Register, offset: 0x604 */
  struct {                                         /* offset: 0x608, array step: 0x8 */
    __IO uint32_t TCSR;                              /*!< Timer Control Status Register, array offset: 0x608, array step: 0x8 */
    __IO uint32_t TCCR;                              /*!< Timer Compare Capture Register, array offset: 0x60C, array step: 0x8 */
  } CHANNEL[4];
} ENET_Type;

/* ----------------------------------------------------------------------------
   -- ENET Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup ENET_Register_Masks ENET Register Masks */
/*! \{ */

