elua/elua/src/platform/kinetis/mk60n512md100.h
#define ENET_IEEE_T_CSERR_Value_SHIFT            0
#define ENET_IEEE_T_CSERR_Value(x)               (((uint32_t)(((uint32_t)(x))<<ENET_IEEE_T_CSERR_Value_SHIFT))&ENET_IEEE_T_CSERR_Value_MASK)
/* IEEE_T_SQE Bit Fields */
#define ENET_IEEE_T_SQE_Value_MASK               0xFFFFFFFFu
#define ENET_IEEE_T_SQE_Value_SHIFT              0
#define ENET_IEEE_T_SQE_Value(x)                 (((uint32_t)(((uint32_t)(x))<<ENET_IEEE_T_SQE_Value_SHIFT))&ENET_IEEE_T_SQE_Value_MASK)
/* IEEE_T_FDXFC Bit Fields */
#define ENET_IEEE_T_FDXFC_Value_MASK             0xFFFFFFFFu
#define ENET_IEEE_T_FDXFC_Value_SHIFT            0
#define ENET_IEEE_T_FDXFC_Value(x)               (((uint32_t)(((uint32_t)(x))<<ENET_IEEE_T_FDXFC_Value_SHIFT))&ENET_IEEE_T_FDXFC_Value_MASK)
/* IEEE_T_OCTETS_OK Bit Fields */
#define ENET_IEEE_T_OCTETS_OK_Value_MASK         0xFFFFFFFFu
#define ENET_IEEE_T_OCTETS_OK_Value_SHIFT        0
#define ENET_IEEE_T_OCTETS_OK_Value(x)           (((uint32_t)(((uint32_t)(x))<<ENET_IEEE_T_OCTETS_OK_Value_SHIFT))&ENET_IEEE_T_OCTETS_OK_Value_MASK)
/* RMON_R_PACKETS Bit Fields */
#define ENET_RMON_R_PACKETS_Value_MASK           0xFFFFFFFFu
#define ENET_RMON_R_PACKETS_Value_SHIFT          0
#define ENET_RMON_R_PACKETS_Value(x)             (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_PACKETS_Value_SHIFT))&ENET_RMON_R_PACKETS_Value_MASK)
/* RMON_R_BC_PKT Bit Fields */
#define ENET_RMON_R_BC_PKT_Value_MASK            0xFFFFFFFFu
#define ENET_RMON_R_BC_PKT_Value_SHIFT           0
#define ENET_RMON_R_BC_PKT_Value(x)              (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_BC_PKT_Value_SHIFT))&ENET_RMON_R_BC_PKT_Value_MASK)
/* RMON_R_MC_PKT Bit Fields */
#define ENET_RMON_R_MC_PKT_Value_MASK            0xFFFFFFFFu
#define ENET_RMON_R_MC_PKT_Value_SHIFT           0
#define ENET_RMON_R_MC_PKT_Value(x)              (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_MC_PKT_Value_SHIFT))&ENET_RMON_R_MC_PKT_Value_MASK)
/* RMON_R_CRC_ALIGN Bit Fields */
#define ENET_RMON_R_CRC_ALIGN_Value_MASK         0xFFFFFFFFu
#define ENET_RMON_R_CRC_ALIGN_Value_SHIFT        0
#define ENET_RMON_R_CRC_ALIGN_Value(x)           (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_CRC_ALIGN_Value_SHIFT))&ENET_RMON_R_CRC_ALIGN_Value_MASK)
/* RMON_R_UNDERSIZE Bit Fields */
#define ENET_RMON_R_UNDERSIZE_Value_MASK         0xFFFFFFFFu
#define ENET_RMON_R_UNDERSIZE_Value_SHIFT        0
#define ENET_RMON_R_UNDERSIZE_Value(x)           (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_UNDERSIZE_Value_SHIFT))&ENET_RMON_R_UNDERSIZE_Value_MASK)
/* RMON_R_OVERSIZE Bit Fields */
#define ENET_RMON_R_OVERSIZE_Value_MASK          0xFFFFFFFFu
#define ENET_RMON_R_OVERSIZE_Value_SHIFT         0
#define ENET_RMON_R_OVERSIZE_Value(x)            (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_OVERSIZE_Value_SHIFT))&ENET_RMON_R_OVERSIZE_Value_MASK)
/* RMON_R_FRAG Bit Fields */
#define ENET_RMON_R_FRAG_Value_MASK              0xFFFFFFFFu
#define ENET_RMON_R_FRAG_Value_SHIFT             0
#define ENET_RMON_R_FRAG_Value(x)                (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_FRAG_Value_SHIFT))&ENET_RMON_R_FRAG_Value_MASK)
/* RMON_R_JAB Bit Fields */
#define ENET_RMON_R_JAB_Value_MASK               0xFFFFFFFFu
#define ENET_RMON_R_JAB_Value_SHIFT              0
#define ENET_RMON_R_JAB_Value(x)                 (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_JAB_Value_SHIFT))&ENET_RMON_R_JAB_Value_MASK)
/* RMON_R_RESVD_0 Bit Fields */
#define ENET_RMON_R_RESVD_0_Value_MASK           0xFFFFFFFFu
#define ENET_RMON_R_RESVD_0_Value_SHIFT          0
#define ENET_RMON_R_RESVD_0_Value(x)             (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_RESVD_0_Value_SHIFT))&ENET_RMON_R_RESVD_0_Value_MASK)
/* RMON_R_P64 Bit Fields */
#define ENET_RMON_R_P64_Value_MASK               0xFFFFFFFFu
#define ENET_RMON_R_P64_Value_SHIFT              0
#define ENET_RMON_R_P64_Value(x)                 (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_P64_Value_SHIFT))&ENET_RMON_R_P64_Value_MASK)
/* RMON_R_P65TO127 Bit Fields */
#define ENET_RMON_R_P65TO127_Value_MASK          0xFFFFFFFFu
#define ENET_RMON_R_P65TO127_Value_SHIFT         0
#define ENET_RMON_R_P65TO127_Value(x)            (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_P65TO127_Value_SHIFT))&ENET_RMON_R_P65TO127_Value_MASK)
/* RMON_R_P128TO255 Bit Fields */
#define ENET_RMON_R_P128TO255_Value_MASK         0xFFFFFFFFu
#define ENET_RMON_R_P128TO255_Value_SHIFT        0
#define ENET_RMON_R_P128TO255_Value(x)           (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_P128TO255_Value_SHIFT))&ENET_RMON_R_P128TO255_Value_MASK)
/* RMON_R_P256TO511 Bit Fields */
#define ENET_RMON_R_P256TO511_Value_MASK         0xFFFFFFFFu
#define ENET_RMON_R_P256TO511_Value_SHIFT        0
#define ENET_RMON_R_P256TO511_Value(x)           (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_P256TO511_Value_SHIFT))&ENET_RMON_R_P256TO511_Value_MASK)
/* RMON_R_P512TO1023 Bit Fields */
#define ENET_RMON_R_P512TO1023_Value_MASK        0xFFFFFFFFu
#define ENET_RMON_R_P512TO1023_Value_SHIFT       0
#define ENET_RMON_R_P512TO1023_Value(x)          (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_P512TO1023_Value_SHIFT))&ENET_RMON_R_P512TO1023_Value_MASK)
/* RMON_R_P1024TO2047 Bit Fields */
#define ENET_RMON_R_P1024TO2047_Value_MASK       0xFFFFFFFFu
#define ENET_RMON_R_P1024TO2047_Value_SHIFT      0
#define ENET_RMON_R_P1024TO2047_Value(x)         (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_P1024TO2047_Value_SHIFT))&ENET_RMON_R_P1024TO2047_Value_MASK)
/* RMON_R_P_GTE2048 Bit Fields */
#define ENET_RMON_R_P_GTE2048_Value_MASK         0xFFFFFFFFu
#define ENET_RMON_R_P_GTE2048_Value_SHIFT        0
#define ENET_RMON_R_P_GTE2048_Value(x)           (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_P_GTE2048_Value_SHIFT))&ENET_RMON_R_P_GTE2048_Value_MASK)
/* RMON_R_OCTETS Bit Fields */
#define ENET_RMON_R_OCTETS_Value_MASK            0xFFFFFFFFu
#define ENET_RMON_R_OCTETS_Value_SHIFT           0
#define ENET_RMON_R_OCTETS_Value(x)              (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_OCTETS_Value_SHIFT))&ENET_RMON_R_OCTETS_Value_MASK)
/* RMON_R_DROP Bit Fields */
#define ENET_RMON_R_DROP_Value_MASK              0xFFFFFFFFu
#define ENET_RMON_R_DROP_Value_SHIFT             0
#define ENET_RMON_R_DROP_Value(x)                (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_DROP_Value_SHIFT))&ENET_RMON_R_DROP_Value_MASK)
/* RMON_R_FRAME_OK Bit Fields */
#define ENET_RMON_R_FRAME_OK_Value_MASK          0xFFFFFFFFu
#define ENET_RMON_R_FRAME_OK_Value_SHIFT         0
#define ENET_RMON_R_FRAME_OK_Value(x)            (((uint32_t)(((uint32_t)(x))<<ENET_RMON_R_FRAME_OK_Value_SHIFT))&ENET_RMON_R_FRAME_OK_Value_MASK)
/* IEEE_R_CRC Bit Fields */
#define ENET_IEEE_R_CRC_Value_MASK               0xFFFFFFFFu
#define ENET_IEEE_R_CRC_Value_SHIFT              0
#define ENET_IEEE_R_CRC_Value(x)                 (((uint32_t)(((uint32_t)(x))<<ENET_IEEE_R_CRC_Value_SHIFT))&ENET_IEEE_R_CRC_Value_MASK)
/* IEEE_R_ALIGN Bit Fields */
#define ENET_IEEE_R_ALIGN_Value_MASK             0xFFFFFFFFu
#define ENET_IEEE_R_ALIGN_Value_SHIFT            0
#define ENET_IEEE_R_ALIGN_Value(x)               (((uint32_t)(((uint32_t)(x))<<ENET_IEEE_R_ALIGN_Value_SHIFT))&ENET_IEEE_R_ALIGN_Value_MASK)
/* IEEE_R_MACERR Bit Fields */
#define ENET_IEEE_R_MACERR_Value_MASK            0xFFFFFFFFu
#define ENET_IEEE_R_MACERR_Value_SHIFT           0
#define ENET_IEEE_R_MACERR_Value(x)              (((uint32_t)(((uint32_t)(x))<<ENET_IEEE_R_MACERR_Value_SHIFT))&ENET_IEEE_R_MACERR_Value_MASK)
/* IEEE_R_FDXFC Bit Fields */
#define ENET_IEEE_R_FDXFC_Value_MASK             0xFFFFFFFFu
#define ENET_IEEE_R_FDXFC_Value_SHIFT            0
#define ENET_IEEE_R_FDXFC_Value(x)               (((uint32_t)(((uint32_t)(x))<<ENET_IEEE_R_FDXFC_Value_SHIFT))&ENET_IEEE_R_FDXFC_Value_MASK)
/* IEEE_R_OCTETS_OK Bit Fields */
#define ENET_IEEE_R_OCTETS_OK_Value_MASK         0xFFFFFFFFu
#define ENET_IEEE_R_OCTETS_OK_Value_SHIFT        0
#define ENET_IEEE_R_OCTETS_OK_Value(x)           (((uint32_t)(((uint32_t)(x))<<ENET_IEEE_R_OCTETS_OK_Value_SHIFT))&ENET_IEEE_R_OCTETS_OK_Value_MASK)
/* ATCR Bit Fields */
#define ENET_ATCR_EN_MASK                        0x1u
#define ENET_ATCR_EN_SHIFT                       0
#define ENET_ATCR_OFFEN_MASK                     0x4u
#define ENET_ATCR_OFFEN_SHIFT                    2
#define ENET_ATCR_OFFRST_MASK                    0x8u
#define ENET_ATCR_OFFRST_SHIFT                   3
#define ENET_ATCR_PEREN_MASK                     0x10u
#define ENET_ATCR_PEREN_SHIFT                    4
#define ENET_ATCR_PINPER_MASK                    0x80u
#define ENET_ATCR_PINPER_SHIFT                   7
#define ENET_ATCR_RESTART_MASK                   0x200u
#define ENET_ATCR_RESTART_SHIFT                  9
#define ENET_ATCR_CAPTURE_MASK                   0x800u
#define ENET_ATCR_CAPTURE_SHIFT                  11
#define ENET_ATCR_SLAVE_MASK                     0x2000u
#define ENET_ATCR_SLAVE_SHIFT                    13
/* ATVR Bit Fields */
#define ENET_ATVR_ATIME_MASK                     0xFFFFFFFFu
#define ENET_ATVR_ATIME_SHIFT                    0
#define ENET_ATVR_ATIME(x)                       (((uint32_t)(((uint32_t)(x))<<ENET_ATVR_ATIME_SHIFT))&ENET_ATVR_ATIME_MASK)
/* ATOFF Bit Fields */
#define ENET_ATOFF_OFFSET_MASK                   0xFFFFFFFFu
#define ENET_ATOFF_OFFSET_SHIFT                  0
#define ENET_ATOFF_OFFSET(x)                     (((uint32_t)(((uint32_t)(x))<<ENET_ATOFF_OFFSET_SHIFT))&ENET_ATOFF_OFFSET_MASK)
/* ATPER Bit Fields */
#define ENET_ATPER_PERIOD_MASK                   0xFFFFFFFFu
#define ENET_ATPER_PERIOD_SHIFT                  0
#define ENET_ATPER_PERIOD(x)                     (((uint32_t)(((uint32_t)(x))<<ENET_ATPER_PERIOD_SHIFT))&ENET_ATPER_PERIOD_MASK)
/* ATCOR Bit Fields */
#define ENET_ATCOR_COR_MASK                      0x7FFFFFFFu
#define ENET_ATCOR_COR_SHIFT                     0
#define ENET_ATCOR_COR(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_ATCOR_COR_SHIFT))&ENET_ATCOR_COR_MASK)
/* ATINC Bit Fields */
#define ENET_ATINC_INC_MASK                      0x7Fu
#define ENET_ATINC_INC_SHIFT                     0
#define ENET_ATINC_INC(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_ATINC_INC_SHIFT))&ENET_ATINC_INC_MASK)
#define ENET_ATINC_INC_CORR_MASK                 0x7F00u
#define ENET_ATINC_INC_CORR_SHIFT                8
#define ENET_ATINC_INC_CORR(x)                   (((uint32_t)(((uint32_t)(x))<<ENET_ATINC_INC_CORR_SHIFT))&ENET_ATINC_INC_CORR_MASK)
/* ATSTMP Bit Fields */
#define ENET_ATSTMP_TIMESTAMP_MASK               0xFFFFFFFFu
#define ENET_ATSTMP_TIMESTAMP_SHIFT              0
#define ENET_ATSTMP_TIMESTAMP(x)                 (((uint32_t)(((uint32_t)(x))<<ENET_ATSTMP_TIMESTAMP_SHIFT))&ENET_ATSTMP_TIMESTAMP_MASK)
/* TGSR Bit Fields */
#define ENET_TGSR_TF0_MASK                       0x1u
#define ENET_TGSR_TF0_SHIFT                      0
#define ENET_TGSR_TF1_MASK                       0x2u
#define ENET_TGSR_TF1_SHIFT                      1
#define ENET_TGSR_TF2_MASK                       0x4u
#define ENET_TGSR_TF2_SHIFT                      2
#define ENET_TGSR_TF3_MASK                       0x8u
#define ENET_TGSR_TF3_SHIFT                      3
/* TCSR Bit Fields */
#define ENET_TCSR_TDRE_MASK                      0x1u
#define ENET_TCSR_TDRE_SHIFT                     0
#define ENET_TCSR_TMODE_MASK                     0x3Cu
#define ENET_TCSR_TMODE_SHIFT                    2
#define ENET_TCSR_TMODE(x)                       (((uint32_t)(((uint32_t)(x))<<ENET_TCSR_TMODE_SHIFT))&ENET_TCSR_TMODE_MASK)
#define ENET_TCSR_TIE_MASK                       0x40u
#define ENET_TCSR_TIE_SHIFT                      6
#define ENET_TCSR_TF_MASK                        0x80u
#define ENET_TCSR_TF_SHIFT                       7
/* TCCR Bit Fields */
#define ENET_TCCR_TCC_MASK                       0xFFFFFFFFu
#define ENET_TCCR_TCC_SHIFT                      0
#define ENET_TCCR_TCC(x)                         (((uint32_t)(((uint32_t)(x))<<ENET_TCCR_TCC_SHIFT))&ENET_TCCR_TCC_MASK)

/*! \} */ /* end of group ENET_Register_Masks */


