elua/elua/src/platform/kinetis/mk60n512md100.h
/*! \} */ /* end of group FTFL_Register_Masks */


/* FTFL - Peripheral instance base addresses */
/*! Peripheral FTFL base address */
#define FTFL_BASE                                (0x40020000u)
/*! Peripheral FTFL base pointer */
#define FTFL                                     ((FTFL_Type *)FTFL_BASE)

/*! \} */ /* end of group FTFL_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- NV Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup NV_Peripheral_Access_Layer NV Peripheral Access Layer */
/*! \{ */

/*! NV - Register Layout Typedef */
typedef struct {
  __I  uint8_t BACKKEY0;                           /*!< Backdoor Comparison Key 0., offset: 0x0 */
  __I  uint8_t BACKKEY1;                           /*!< Backdoor Comparison Key 1., offset: 0x1 */
  __I  uint8_t BACKKEY2;                           /*!< Backdoor Comparison Key 2., offset: 0x2 */
  __I  uint8_t BACKKEY3;                           /*!< Backdoor Comparison Key 3., offset: 0x3 */
  __I  uint8_t BACKKEY4;                           /*!< Backdoor Comparison Key 4., offset: 0x4 */
  __I  uint8_t BACKKEY5;                           /*!< Backdoor Comparison Key 5., offset: 0x5 */
  __I  uint8_t BACKKEY6;                           /*!< Backdoor Comparison Key 6., offset: 0x6 */
  __I  uint8_t BACKKEY7;                           /*!< Backdoor Comparison Key 7., offset: 0x7 */
  __I  uint8_t NVPROT3;                            /*!< Non-volatile P-Flash Protection 1 - Low Register, offset: 0x8 */
  __I  uint8_t NVPROT2;                            /*!< Non-volatile P-Flash Protection 1 - High Register, offset: 0x9 */
  __I  uint8_t NVPROT1;                            /*!< Non-volatile P-Flash Protection 0 - Low Register, offset: 0xA */
  __I  uint8_t NVPROT0;                            /*!< Non-volatile P-Flash Protection 0 - High Register, offset: 0xB */
  __I  uint8_t NVDPROT;                            /*!< Non-volatile D-Flash Protection Register, offset: 0xC */
  __I  uint8_t NVEPROT;                            /*!< Non-volatile EERAM Protection Register, offset: 0xD */
  __I  uint8_t NVOPT;                              /*!< Non-volatile Flash Option Register, offset: 0xE */
  __I  uint8_t NVSEC;                              /*!< Non-volatile Flash Security Register, offset: 0xF */
} NV_Type;

/* ----------------------------------------------------------------------------
   -- NV Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup NV_Register_Masks NV Register Masks */
/*! \{ */

/* BACKKEY0 Bit Fields */
#define NV_BACKKEY0_KEY_MASK                     0xFFu
#define NV_BACKKEY0_KEY_SHIFT                    0
#define NV_BACKKEY0_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY0_KEY_SHIFT))&NV_BACKKEY0_KEY_MASK)
/* BACKKEY1 Bit Fields */
#define NV_BACKKEY1_KEY_MASK                     0xFFu
#define NV_BACKKEY1_KEY_SHIFT                    0
#define NV_BACKKEY1_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY1_KEY_SHIFT))&NV_BACKKEY1_KEY_MASK)
/* BACKKEY2 Bit Fields */
#define NV_BACKKEY2_KEY_MASK                     0xFFu
#define NV_BACKKEY2_KEY_SHIFT                    0
#define NV_BACKKEY2_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY2_KEY_SHIFT))&NV_BACKKEY2_KEY_MASK)
/* BACKKEY3 Bit Fields */
#define NV_BACKKEY3_KEY_MASK                     0xFFu
#define NV_BACKKEY3_KEY_SHIFT                    0
#define NV_BACKKEY3_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY3_KEY_SHIFT))&NV_BACKKEY3_KEY_MASK)
/* BACKKEY4 Bit Fields */
#define NV_BACKKEY4_KEY_MASK                     0xFFu
#define NV_BACKKEY4_KEY_SHIFT                    0
#define NV_BACKKEY4_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY4_KEY_SHIFT))&NV_BACKKEY4_KEY_MASK)
/* BACKKEY5 Bit Fields */
#define NV_BACKKEY5_KEY_MASK                     0xFFu
#define NV_BACKKEY5_KEY_SHIFT                    0
#define NV_BACKKEY5_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY5_KEY_SHIFT))&NV_BACKKEY5_KEY_MASK)
/* BACKKEY6 Bit Fields */
#define NV_BACKKEY6_KEY_MASK                     0xFFu
#define NV_BACKKEY6_KEY_SHIFT                    0
#define NV_BACKKEY6_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY6_KEY_SHIFT))&NV_BACKKEY6_KEY_MASK)
/* BACKKEY7 Bit Fields */
#define NV_BACKKEY7_KEY_MASK                     0xFFu
#define NV_BACKKEY7_KEY_SHIFT                    0
#define NV_BACKKEY7_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY7_KEY_SHIFT))&NV_BACKKEY7_KEY_MASK)
/* NVPROT3 Bit Fields */
#define NV_NVPROT3_PROT_MASK                     0xFFu
#define NV_NVPROT3_PROT_SHIFT                    0
#define NV_NVPROT3_PROT(x)                       (((uint8_t)(((uint8_t)(x))<<NV_NVPROT3_PROT_SHIFT))&NV_NVPROT3_PROT_MASK)
/* NVPROT2 Bit Fields */
#define NV_NVPROT2_PROT_MASK                     0xFFu
#define NV_NVPROT2_PROT_SHIFT                    0
#define NV_NVPROT2_PROT(x)                       (((uint8_t)(((uint8_t)(x))<<NV_NVPROT2_PROT_SHIFT))&NV_NVPROT2_PROT_MASK)
/* NVPROT1 Bit Fields */
#define NV_NVPROT1_PROT_MASK                     0xFFu
#define NV_NVPROT1_PROT_SHIFT                    0
#define NV_NVPROT1_PROT(x)                       (((uint8_t)(((uint8_t)(x))<<NV_NVPROT1_PROT_SHIFT))&NV_NVPROT1_PROT_MASK)
/* NVPROT0 Bit Fields */
#define NV_NVPROT0_PROT_MASK                     0xFFu
#define NV_NVPROT0_PROT_SHIFT                    0
#define NV_NVPROT0_PROT(x)                       (((uint8_t)(((uint8_t)(x))<<NV_NVPROT0_PROT_SHIFT))&NV_NVPROT0_PROT_MASK)
/* NVDPROT Bit Fields */
#define NV_NVDPROT_DPROT_MASK                    0xFFu
#define NV_NVDPROT_DPROT_SHIFT                   0
#define NV_NVDPROT_DPROT(x)                      (((uint8_t)(((uint8_t)(x))<<NV_NVDPROT_DPROT_SHIFT))&NV_NVDPROT_DPROT_MASK)
/* NVEPROT Bit Fields */
#define NV_NVEPROT_EPROT_MASK                    0xFFu
#define NV_NVEPROT_EPROT_SHIFT                   0
#define NV_NVEPROT_EPROT(x)                      (((uint8_t)(((uint8_t)(x))<<NV_NVEPROT_EPROT_SHIFT))&NV_NVEPROT_EPROT_MASK)
/* NVOPT Bit Fields */
#define NV_NVOPT_NVOPT_MASK                      0xFFu
#define NV_NVOPT_NVOPT_SHIFT                     0
#define NV_NVOPT_NVOPT(x)                        (((uint8_t)(((uint8_t)(x))<<NV_NVOPT_NVOPT_SHIFT))&NV_NVOPT_NVOPT_MASK)
/* NVSEC Bit Fields */
#define NV_NVSEC_SEC_MASK                        0x3u
#define NV_NVSEC_SEC_SHIFT                       0
#define NV_NVSEC_SEC(x)                          (((uint8_t)(((uint8_t)(x))<<NV_NVSEC_SEC_SHIFT))&NV_NVSEC_SEC_MASK)
#define NV_NVSEC_FSLACC_MASK                     0xCu
#define NV_NVSEC_FSLACC_SHIFT                    2
#define NV_NVSEC_FSLACC(x)                       (((uint8_t)(((uint8_t)(x))<<NV_NVSEC_FSLACC_SHIFT))&NV_NVSEC_FSLACC_MASK)
#define NV_NVSEC_MEEN_MASK                       0x30u
#define NV_NVSEC_MEEN_SHIFT                      4
#define NV_NVSEC_MEEN(x)                         (((uint8_t)(((uint8_t)(x))<<NV_NVSEC_MEEN_SHIFT))&NV_NVSEC_MEEN_MASK)
#define NV_NVSEC_KEYEN_MASK                      0xC0u
#define NV_NVSEC_KEYEN_SHIFT                     6
#define NV_NVSEC_KEYEN(x)                        (((uint8_t)(((uint8_t)(x))<<NV_NVSEC_KEYEN_SHIFT))&NV_NVSEC_KEYEN_MASK)

/*! \} */ /* end of group NV_Register_Masks */


