elua/elua/src/platform/kinetis/mk60n512md100.h
/* MPU - Peripheral instance base addresses */
/*! Peripheral MPU base address */
#define MPU_BASE                                 (0x4000D000u)
/*! Peripheral MPU base pointer */
#define MPU                                      ((MPU_Type *)MPU_BASE)

/*! \} */ /* end of group MPU_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- OSC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup OSC_Peripheral_Access_Layer OSC Peripheral Access Layer */
/*! \{ */

/*! OSC - Register Layout Typedef */
typedef struct {
  __IO uint8_t CR;                                 /*!< OSC Control Register, offset: 0x0 */
} OSC_Type;

/* ----------------------------------------------------------------------------
   -- OSC Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup OSC_Register_Masks OSC Register Masks */
/*! \{ */

/* CR Bit Fields */
#define OSC_CR_SC16P_MASK                        0x1u
#define OSC_CR_SC16P_SHIFT                       0
#define OSC_CR_SC8P_MASK                         0x2u
#define OSC_CR_SC8P_SHIFT                        1
#define OSC_CR_SC4P_MASK                         0x4u
#define OSC_CR_SC4P_SHIFT                        2
#define OSC_CR_SC2P_MASK                         0x8u
#define OSC_CR_SC2P_SHIFT                        3
#define OSC_CR_EREFSTEN_MASK                     0x20u
#define OSC_CR_EREFSTEN_SHIFT                    5
#define OSC_CR_ERCLKEN_MASK                      0x80u
#define OSC_CR_ERCLKEN_SHIFT                     7

/*! \} */ /* end of group OSC_Register_Masks */


/* OSC - Peripheral instance base addresses */
/*! Peripheral OSC base address */
#define OSC_BASE                                 (0x40065000u)
/*! Peripheral OSC base pointer */
#define OSC                                      ((OSC_Type *)OSC_BASE)

/*! \} */ /* end of group OSC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PDB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup PDB_Peripheral_Access_Layer PDB Peripheral Access Layer */
/*! \{ */

/*! PDB - Register Layout Typedef */
typedef struct {
  __IO uint32_t SC;                                /*!< Status and Control Register, offset: 0x0 */
  __IO uint32_t MOD;                               /*!< Modulus Register, offset: 0x4 */
  __I  uint32_t CNT;                               /*!< Counter Register, offset: 0x8 */
  __IO uint32_t IDLY;                              /*!< Interrupt Delay Register, offset: 0xC */
  __IO uint32_t CH0C1;                             /*!< Channel n Control Register 1, offset: 0x10 */
  __IO uint32_t CH0S;                              /*!< Channel n Status Register, offset: 0x14 */
  __IO uint32_t CH0DLY0;                           /*!< Channel n Delay 0 Register, offset: 0x18 */
  __IO uint32_t CH0DLY1;                           /*!< Channel n Delay 1 Register, offset: 0x1C */
       uint8_t RESERVED_0[24];
  __IO uint32_t CH1C1;                             /*!< Channel n Control Register 1, offset: 0x38 */
  __IO uint32_t CH1S;                              /*!< Channel n Status Register, offset: 0x3C */
  __IO uint32_t CH1DLY0;                           /*!< Channel n Delay 0 Register, offset: 0x40 */
  __IO uint32_t CH1DLY1;                           /*!< Channel n Delay 1 Register, offset: 0x44 */
       uint8_t RESERVED_1[264];
  __IO uint32_t DACINTC0;                          /*!< DAC Interval Trigger n Control Register, offset: 0x150 */
  __IO uint32_t DACINT0;                           /*!< DAC Interval n Register, offset: 0x154 */
  __IO uint32_t DACINTC1;                          /*!< DAC Interval Trigger n Control Register, offset: 0x158 */
  __IO uint32_t DACINT1;                           /*!< DAC Interval n Register, offset: 0x15C */
       uint8_t RESERVED_2[48];
  __IO uint32_t POEN;                              /*!< Pulse-Out n Enable Register, offset: 0x190 */
  __IO uint32_t PODLY;                             /*!< Pulse-Out n Delay Register, offset: 0x194 */
} PDB_Type;

/* ----------------------------------------------------------------------------
   -- PDB Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup PDB_Register_Masks PDB Register Masks */
/*! \{ */

/* SC Bit Fields */
#define PDB_SC_LDOK_MASK                         0x1u
#define PDB_SC_LDOK_SHIFT                        0
#define PDB_SC_CONT_MASK                         0x2u
#define PDB_SC_CONT_SHIFT                        1
#define PDB_SC_MULT_MASK                         0xCu
#define PDB_SC_MULT_SHIFT                        2
#define PDB_SC_MULT(x)                           (((uint32_t)(((uint32_t)(x))<<PDB_SC_MULT_SHIFT))&PDB_SC_MULT_MASK)
#define PDB_SC_PDBIE_MASK                        0x20u
#define PDB_SC_PDBIE_SHIFT                       5
#define PDB_SC_PDBIF_MASK                        0x40u
#define PDB_SC_PDBIF_SHIFT                       6
#define PDB_SC_PDBEN_MASK                        0x80u
#define PDB_SC_PDBEN_SHIFT                       7
#define PDB_SC_TRGSEL_MASK                       0xF00u
#define PDB_SC_TRGSEL_SHIFT                      8
#define PDB_SC_TRGSEL(x)                         (((uint32_t)(((uint32_t)(x))<<PDB_SC_TRGSEL_SHIFT))&PDB_SC_TRGSEL_MASK)
#define PDB_SC_PRESCALER_MASK                    0x7000u
#define PDB_SC_PRESCALER_SHIFT                   12
#define PDB_SC_PRESCALER(x)                      (((uint32_t)(((uint32_t)(x))<<PDB_SC_PRESCALER_SHIFT))&PDB_SC_PRESCALER_MASK)
#define PDB_SC_DMAEN_MASK                        0x8000u
#define PDB_SC_DMAEN_SHIFT                       15
#define PDB_SC_SWTRIG_MASK                       0x10000u
#define PDB_SC_SWTRIG_SHIFT                      16
#define PDB_SC_PDBEIE_MASK                       0x20000u
#define PDB_SC_PDBEIE_SHIFT                      17
#define PDB_SC_LDMOD_MASK                        0xC0000u
#define PDB_SC_LDMOD_SHIFT                       18
#define PDB_SC_LDMOD(x)                          (((uint32_t)(((uint32_t)(x))<<PDB_SC_LDMOD_SHIFT))&PDB_SC_LDMOD_MASK)
/* MOD Bit Fields */
#define PDB_MOD_MOD_MASK                         0xFFFFu
#define PDB_MOD_MOD_SHIFT                        0
#define PDB_MOD_MOD(x)                           (((uint32_t)(((uint32_t)(x))<<PDB_MOD_MOD_SHIFT))&PDB_MOD_MOD_MASK)
/* CNT Bit Fields */
#define PDB_CNT_CNT_MASK                         0xFFFFu
#define PDB_CNT_CNT_SHIFT                        0
#define PDB_CNT_CNT(x)                           (((uint32_t)(((uint32_t)(x))<<PDB_CNT_CNT_SHIFT))&PDB_CNT_CNT_MASK)
/* IDLY Bit Fields */
#define PDB_IDLY_IDLY_MASK                       0xFFFFu
#define PDB_IDLY_IDLY_SHIFT                      0
#define PDB_IDLY_IDLY(x)                         (((uint32_t)(((uint32_t)(x))<<PDB_IDLY_IDLY_SHIFT))&PDB_IDLY_IDLY_MASK)
/* CH0C1 Bit Fields */
#define PDB_CH0C1_EN_MASK                        0xFFu
#define PDB_CH0C1_EN_SHIFT                       0
#define PDB_CH0C1_EN(x)                          (((uint32_t)(((uint32_t)(x))<<PDB_CH0C1_EN_SHIFT))&PDB_CH0C1_EN_MASK)
#define PDB_CH0C1_TOS_MASK                       0xFF00u
#define PDB_CH0C1_TOS_SHIFT                      8
#define PDB_CH0C1_TOS(x)                         (((uint32_t)(((uint32_t)(x))<<PDB_CH0C1_TOS_SHIFT))&PDB_CH0C1_TOS_MASK)
#define PDB_CH0C1_BB_MASK                        0xFF0000u
#define PDB_CH0C1_BB_SHIFT                       16
#define PDB_CH0C1_BB(x)                          (((uint32_t)(((uint32_t)(x))<<PDB_CH0C1_BB_SHIFT))&PDB_CH0C1_BB_MASK)
/* CH0S Bit Fields */
#define PDB_CH0S_ERR_MASK                        0xFFu
#define PDB_CH0S_ERR_SHIFT                       0
#define PDB_CH0S_ERR(x)                          (((uint32_t)(((uint32_t)(x))<<PDB_CH0S_ERR_SHIFT))&PDB_CH0S_ERR_MASK)
#define PDB_CH0S_CF_MASK                         0xFF0000u
#define PDB_CH0S_CF_SHIFT                        16
#define PDB_CH0S_CF(x)                           (((uint32_t)(((uint32_t)(x))<<PDB_CH0S_CF_SHIFT))&PDB_CH0S_CF_MASK)
/* CH0DLY0 Bit Fields */
#define PDB_CH0DLY0_DLY_MASK                     0xFFFFu
#define PDB_CH0DLY0_DLY_SHIFT                    0
#define PDB_CH0DLY0_DLY(x)                       (((uint32_t)(((uint32_t)(x))<<PDB_CH0DLY0_DLY_SHIFT))&PDB_CH0DLY0_DLY_MASK)
/* CH0DLY1 Bit Fields */
#define PDB_CH0DLY1_DLY_MASK                     0xFFFFu
#define PDB_CH0DLY1_DLY_SHIFT                    0
#define PDB_CH0DLY1_DLY(x)                       (((uint32_t)(((uint32_t)(x))<<PDB_CH0DLY1_DLY_SHIFT))&PDB_CH0DLY1_DLY_MASK)
/* CH1C1 Bit Fields */
#define PDB_CH1C1_EN_MASK                        0xFFu
#define PDB_CH1C1_EN_SHIFT                       0
#define PDB_CH1C1_EN(x)                          (((uint32_t)(((uint32_t)(x))<<PDB_CH1C1_EN_SHIFT))&PDB_CH1C1_EN_MASK)
#define PDB_CH1C1_TOS_MASK                       0xFF00u
#define PDB_CH1C1_TOS_SHIFT                      8
#define PDB_CH1C1_TOS(x)                         (((uint32_t)(((uint32_t)(x))<<PDB_CH1C1_TOS_SHIFT))&PDB_CH1C1_TOS_MASK)
#define PDB_CH1C1_BB_MASK                        0xFF0000u
#define PDB_CH1C1_BB_SHIFT                       16
#define PDB_CH1C1_BB(x)                          (((uint32_t)(((uint32_t)(x))<<PDB_CH1C1_BB_SHIFT))&PDB_CH1C1_BB_MASK)
/* CH1S Bit Fields */
#define PDB_CH1S_ERR_MASK                        0xFFu
#define PDB_CH1S_ERR_SHIFT                       0
#define PDB_CH1S_ERR(x)                          (((uint32_t)(((uint32_t)(x))<<PDB_CH1S_ERR_SHIFT))&PDB_CH1S_ERR_MASK)
#define PDB_CH1S_CF_MASK                         0xFF0000u
#define PDB_CH1S_CF_SHIFT                        16
#define PDB_CH1S_CF(x)                           (((uint32_t)(((uint32_t)(x))<<PDB_CH1S_CF_SHIFT))&PDB_CH1S_CF_MASK)
/* CH1DLY0 Bit Fields */
#define PDB_CH1DLY0_DLY_MASK                     0xFFFFu
#define PDB_CH1DLY0_DLY_SHIFT                    0
#define PDB_CH1DLY0_DLY(x)                       (((uint32_t)(((uint32_t)(x))<<PDB_CH1DLY0_DLY_SHIFT))&PDB_CH1DLY0_DLY_MASK)
/* CH1DLY1 Bit Fields */
#define PDB_CH1DLY1_DLY_MASK                     0xFFFFu
#define PDB_CH1DLY1_DLY_SHIFT                    0
#define PDB_CH1DLY1_DLY(x)                       (((uint32_t)(((uint32_t)(x))<<PDB_CH1DLY1_DLY_SHIFT))&PDB_CH1DLY1_DLY_MASK)
/* DACINTC0 Bit Fields */
#define PDB_DACINTC0_TOE_MASK                    0x1u
#define PDB_DACINTC0_TOE_SHIFT                   0
#define PDB_DACINTC0_EXT_MASK                    0x2u
#define PDB_DACINTC0_EXT_SHIFT                   1
/* DACINT0 Bit Fields */
#define PDB_DACINT0_INT_MASK                     0xFFFFu
#define PDB_DACINT0_INT_SHIFT                    0
#define PDB_DACINT0_INT(x)                       (((uint32_t)(((uint32_t)(x))<<PDB_DACINT0_INT_SHIFT))&PDB_DACINT0_INT_MASK)
/* DACINTC1 Bit Fields */
#define PDB_DACINTC1_TOE_MASK                    0x1u
#define PDB_DACINTC1_TOE_SHIFT                   0
#define PDB_DACINTC1_EXT_MASK                    0x2u
#define PDB_DACINTC1_EXT_SHIFT                   1
/* DACINT1 Bit Fields */
#define PDB_DACINT1_INT_MASK                     0xFFFFu
#define PDB_DACINT1_INT_SHIFT                    0
#define PDB_DACINT1_INT(x)                       (((uint32_t)(((uint32_t)(x))<<PDB_DACINT1_INT_SHIFT))&PDB_DACINT1_INT_MASK)
/* POEN Bit Fields */
#define PDB_POEN_POEN_MASK                       0xFFu
#define PDB_POEN_POEN_SHIFT                      0
#define PDB_POEN_POEN(x)                         (((uint32_t)(((uint32_t)(x))<<PDB_POEN_POEN_SHIFT))&PDB_POEN_POEN_MASK)
/* PODLY Bit Fields */
#define PDB_PODLY_DLY2_MASK                      0xFFFFu
#define PDB_PODLY_DLY2_SHIFT                     0
#define PDB_PODLY_DLY2(x)                        (((uint32_t)(((uint32_t)(x))<<PDB_PODLY_DLY2_SHIFT))&PDB_PODLY_DLY2_MASK)
#define PDB_PODLY_DLY1_MASK                      0xFFFF0000u
#define PDB_PODLY_DLY1_SHIFT                     16
#define PDB_PODLY_DLY1(x)                        (((uint32_t)(((uint32_t)(x))<<PDB_PODLY_DLY1_SHIFT))&PDB_PODLY_DLY1_MASK)

/*! \} */ /* end of group PDB_Register_Masks */


/* PDB - Peripheral instance base addresses */
/*! Peripheral PDB0 base address */
#define PDB0_BASE                                (0x40036000u)
/*! Peripheral PDB0 base pointer */
#define PDB0                                     ((PDB_Type *)PDB0_BASE)

