elua/elua/src/platform/kinetis/mk60n512md100.h
/* PDOR Bit Fields */
#define GPIO_PDOR_PDO_MASK                       0xFFFFFFFFu
#define GPIO_PDOR_PDO_SHIFT                      0
#define GPIO_PDOR_PDO(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO_PDOR_PDO_SHIFT))&GPIO_PDOR_PDO_MASK)
/* PSOR Bit Fields */
#define GPIO_PSOR_PTSO_MASK                      0xFFFFFFFFu
#define GPIO_PSOR_PTSO_SHIFT                     0
#define GPIO_PSOR_PTSO(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO_PSOR_PTSO_SHIFT))&GPIO_PSOR_PTSO_MASK)
/* PCOR Bit Fields */
#define GPIO_PCOR_PTCO_MASK                      0xFFFFFFFFu
#define GPIO_PCOR_PTCO_SHIFT                     0
#define GPIO_PCOR_PTCO(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO_PCOR_PTCO_SHIFT))&GPIO_PCOR_PTCO_MASK)
/* PTOR Bit Fields */
#define GPIO_PTOR_PTTO_MASK                      0xFFFFFFFFu
#define GPIO_PTOR_PTTO_SHIFT                     0
#define GPIO_PTOR_PTTO(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO_PTOR_PTTO_SHIFT))&GPIO_PTOR_PTTO_MASK)
/* PDIR Bit Fields */
#define GPIO_PDIR_PDI_MASK                       0xFFFFFFFFu
#define GPIO_PDIR_PDI_SHIFT                      0
#define GPIO_PDIR_PDI(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO_PDIR_PDI_SHIFT))&GPIO_PDIR_PDI_MASK)
/* POER Bit Fields */
#define GPIO_POER_POE_MASK                       0xFFFFFFFFu
#define GPIO_POER_POE_SHIFT                      0
#define GPIO_POER_POE(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO_POER_POE_SHIFT))&GPIO_POER_POE_MASK)

/*! \} */ /* end of group GPIO_Register_Masks */


/* GPIO - Peripheral instance base addresses */
/*! Peripheral PTA base address */
#define PTA_BASE                                 (0x400FF000u)
/*! Peripheral PTA base pointer */
#define PTA                                      ((GPIO_Type *)PTA_BASE)
/*! Peripheral PTB base address */
#define PTB_BASE                                 (0x400FF040u)
/*! Peripheral PTB base pointer */
#define PTB                                      ((GPIO_Type *)PTB_BASE)
/*! Peripheral PTC base address */
#define PTC_BASE                                 (0x400FF080u)
/*! Peripheral PTC base pointer */
#define PTC                                      ((GPIO_Type *)PTC_BASE)
/*! Peripheral PTD base address */
#define PTD_BASE                                 (0x400FF0C0u)
/*! Peripheral PTD base pointer */
#define PTD                                      ((GPIO_Type *)PTD_BASE)
/*! Peripheral PTE base address */
#define PTE_BASE                                 (0x400FF100u)
/*! Peripheral PTE base pointer */
#define PTE                                      ((GPIO_Type *)PTE_BASE)

/*! \} */ /* end of group GPIO_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RNG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup RNG_Peripheral_Access_Layer RNG Peripheral Access Layer */
/*! \{ */

/*! RNG - Register Layout Typedef */
typedef struct {
  __I  uint32_t VER;                               /*!< RNGB Version ID Register, offset: 0x0 */
  __IO uint32_t CMD;                               /*!< RNGB Command Register, offset: 0x4 */
  __IO uint32_t CR;                                /*!< RNGB Control Register, offset: 0x8 */
  __I  uint32_t SR;                                /*!< RNGB Status Register, offset: 0xC */
  __I  uint32_t ESR;                               /*!< RNGB Error Status Register, offset: 0x10 */
  __I  uint32_t OUT;                               /*!< RNGB Output FIFO, offset: 0x14 */
} RNG_Type;

/* ----------------------------------------------------------------------------
   -- RNG Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup RNG_Register_Masks RNG Register Masks */
/*! \{ */

/* VER Bit Fields */
#define RNG_VER_MINOR_MASK                       0xFFu
#define RNG_VER_MINOR_SHIFT                      0
#define RNG_VER_MINOR(x)                         (((uint32_t)(((uint32_t)(x))<<RNG_VER_MINOR_SHIFT))&RNG_VER_MINOR_MASK)
#define RNG_VER_MAJOR_MASK                       0xFF00u
#define RNG_VER_MAJOR_SHIFT                      8
#define RNG_VER_MAJOR(x)                         (((uint32_t)(((uint32_t)(x))<<RNG_VER_MAJOR_SHIFT))&RNG_VER_MAJOR_MASK)
#define RNG_VER_TYPE_MASK                        0xF0000000u
#define RNG_VER_TYPE_SHIFT                       28
#define RNG_VER_TYPE(x)                          (((uint32_t)(((uint32_t)(x))<<RNG_VER_TYPE_SHIFT))&RNG_VER_TYPE_MASK)
/* CMD Bit Fields */
#define RNG_CMD_ST_MASK                          0x1u
#define RNG_CMD_ST_SHIFT                         0
#define RNG_CMD_GS_MASK                          0x2u
#define RNG_CMD_GS_SHIFT                         1
#define RNG_CMD_CI_MASK                          0x10u
#define RNG_CMD_CI_SHIFT                         4
#define RNG_CMD_CE_MASK                          0x20u
#define RNG_CMD_CE_SHIFT                         5
#define RNG_CMD_SR_MASK                          0x40u
#define RNG_CMD_SR_SHIFT                         6
/* CR Bit Fields */
#define RNG_CR_FUFMOD_MASK                       0x3u
#define RNG_CR_FUFMOD_SHIFT                      0
#define RNG_CR_FUFMOD(x)                         (((uint32_t)(((uint32_t)(x))<<RNG_CR_FUFMOD_SHIFT))&RNG_CR_FUFMOD_MASK)
#define RNG_CR_AR_MASK                           0x10u
#define RNG_CR_AR_SHIFT                          4
#define RNG_CR_MASKDONE_MASK                     0x20u
#define RNG_CR_MASKDONE_SHIFT                    5
#define RNG_CR_MASKERR_MASK                      0x40u
#define RNG_CR_MASKERR_SHIFT                     6
/* SR Bit Fields */
#define RNG_SR_BUSY_MASK                         0x2u
#define RNG_SR_BUSY_SHIFT                        1
#define RNG_SR_SLP_MASK                          0x4u
#define RNG_SR_SLP_SHIFT                         2
#define RNG_SR_RS_MASK                           0x8u
#define RNG_SR_RS_SHIFT                          3
#define RNG_SR_STDN_MASK                         0x10u
#define RNG_SR_STDN_SHIFT                        4
#define RNG_SR_SDN_MASK                          0x20u
#define RNG_SR_SDN_SHIFT                         5
#define RNG_SR_NSDN_MASK                         0x40u
#define RNG_SR_NSDN_SHIFT                        6
#define RNG_SR_FIFO_LVL_MASK                     0xF00u
#define RNG_SR_FIFO_LVL_SHIFT                    8
#define RNG_SR_FIFO_LVL(x)                       (((uint32_t)(((uint32_t)(x))<<RNG_SR_FIFO_LVL_SHIFT))&RNG_SR_FIFO_LVL_MASK)
#define RNG_SR_FIFO_SIZE_MASK                    0xF000u
#define RNG_SR_FIFO_SIZE_SHIFT                   12
#define RNG_SR_FIFO_SIZE(x)                      (((uint32_t)(((uint32_t)(x))<<RNG_SR_FIFO_SIZE_SHIFT))&RNG_SR_FIFO_SIZE_MASK)
#define RNG_SR_ERR_MASK                          0x10000u
#define RNG_SR_ERR_SHIFT                         16
#define RNG_SR_ST_PF_MASK                        0xE00000u
#define RNG_SR_ST_PF_SHIFT                       21
#define RNG_SR_ST_PF(x)                          (((uint32_t)(((uint32_t)(x))<<RNG_SR_ST_PF_SHIFT))&RNG_SR_ST_PF_MASK)
#define RNG_SR_STATPF_MASK                       0xFF000000u
#define RNG_SR_STATPF_SHIFT                      24
#define RNG_SR_STATPF(x)                         (((uint32_t)(((uint32_t)(x))<<RNG_SR_STATPF_SHIFT))&RNG_SR_STATPF_MASK)
/* ESR Bit Fields */
#define RNG_ESR_LFE_MASK                         0x1u
#define RNG_ESR_LFE_SHIFT                        0
#define RNG_ESR_OSCE_MASK                        0x2u
#define RNG_ESR_OSCE_SHIFT                       1
#define RNG_ESR_STE_MASK                         0x4u
#define RNG_ESR_STE_SHIFT                        2
#define RNG_ESR_SATE_MASK                        0x8u
#define RNG_ESR_SATE_SHIFT                       3
#define RNG_ESR_FUFE_MASK                        0x10u
#define RNG_ESR_FUFE_SHIFT                       4
/* OUT Bit Fields */
#define RNG_OUT_RANDOUT_MASK                     0xFFFFFFFFu
#define RNG_OUT_RANDOUT_SHIFT                    0
#define RNG_OUT_RANDOUT(x)                       (((uint32_t)(((uint32_t)(x))<<RNG_OUT_RANDOUT_SHIFT))&RNG_OUT_RANDOUT_MASK)

/*! \} */ /* end of group RNG_Register_Masks */


/* RNG - Peripheral instance base addresses */
/*! Peripheral RNGB base address */
#define RNGB_BASE                                (0x400A0000u)
/*! Peripheral RNGB base pointer */
#define RNGB                                     ((RNG_Type *)RNGB_BASE)

/*! \} */ /* end of group RNG_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RTC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

