elua/elua/src/platform/kinetis/mk60n512md100.h
/*! \} */ /* end of group SPI_Register_Masks */


/* SPI - Peripheral instance base addresses */
/*! Peripheral SPI0 base address */
#define SPI0_BASE                                (0x4002C000u)
/*! Peripheral SPI0 base pointer */
#define SPI0                                     ((SPI_Type *)SPI0_BASE)
/*! Peripheral SPI1 base address */
#define SPI1_BASE                                (0x4002D000u)
/*! Peripheral SPI1 base pointer */
#define SPI1                                     ((SPI_Type *)SPI1_BASE)
/*! Peripheral SPI2 base address */
#define SPI2_BASE                                (0x400AC000u)
/*! Peripheral SPI2 base pointer */
#define SPI2                                     ((SPI_Type *)SPI2_BASE)

/*! \} */ /* end of group SPI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- TSI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup TSI_Peripheral_Access_Layer TSI Peripheral Access Layer */
/*! \{ */

/*! TSI - Register Layout Typedef */
typedef struct {
  __IO uint32_t GENCS;                             /*!< General Control and Status Register, offset: 0x0 */
  __IO uint32_t SCANC;                             /*!< SCAN Control Register, offset: 0x4 */
  __IO uint32_t PEN;                               /*!< Pin Enable Register, offset: 0x8 */
       uint8_t RESERVED_0[4];
  __I  uint32_t WUCNTR;                            /*!< Wake-Up Channel Counter Register, offset: 0x10 */
       uint8_t RESERVED_1[236];
  __I  uint32_t CNTR1;                             /*!< Counter Register, offset: 0x100 */
  __I  uint32_t CNTR3;                             /*!< Counter Register, offset: 0x104 */
  __I  uint32_t CNTR5;                             /*!< Counter Register, offset: 0x108 */
  __I  uint32_t CNTR7;                             /*!< Counter Register, offset: 0x10C */
  __I  uint32_t CNTR9;                             /*!< Counter Register, offset: 0x110 */
  __I  uint32_t CNTR11;                            /*!< Counter Register, offset: 0x114 */
  __I  uint32_t CNTR13;                            /*!< Counter Register, offset: 0x118 */
  __I  uint32_t CNTR15;                            /*!< Counter Register, offset: 0x11C */
  __IO uint32_t THRESHLD[16];                      /*!< Channel N Threshold Register, array offset: 0x120, array step: 0x4 */
} TSI_Type;

/* ----------------------------------------------------------------------------
   -- TSI Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup TSI_Register_Masks TSI Register Masks */
/*! \{ */

/* GENCS Bit Fields */
#define TSI_GENCS_STPE_MASK                      0x1u
#define TSI_GENCS_STPE_SHIFT                     0
#define TSI_GENCS_STM_MASK                       0x2u
#define TSI_GENCS_STM_SHIFT                      1
#define TSI_GENCS_ESOR_MASK                      0x10u
#define TSI_GENCS_ESOR_SHIFT                     4
#define TSI_GENCS_ERIE_MASK                      0x20u
#define TSI_GENCS_ERIE_SHIFT                     5
#define TSI_GENCS_TSIIE_MASK                     0x40u
#define TSI_GENCS_TSIIE_SHIFT                    6
#define TSI_GENCS_TSIEN_MASK                     0x80u
#define TSI_GENCS_TSIEN_SHIFT                    7
#define TSI_GENCS_SWTS_MASK                      0x100u
#define TSI_GENCS_SWTS_SHIFT                     8
#define TSI_GENCS_SCNIP_MASK                     0x200u
#define TSI_GENCS_SCNIP_SHIFT                    9
#define TSI_GENCS_OVRF_MASK                      0x1000u
#define TSI_GENCS_OVRF_SHIFT                     12
#define TSI_GENCS_EXTERF_MASK                    0x2000u
#define TSI_GENCS_EXTERF_SHIFT                   13
#define TSI_GENCS_OUTRGF_MASK                    0x4000u
#define TSI_GENCS_OUTRGF_SHIFT                   14
#define TSI_GENCS_EOSF_MASK                      0x8000u
#define TSI_GENCS_EOSF_SHIFT                     15
#define TSI_GENCS_PS_MASK                        0x70000u
#define TSI_GENCS_PS_SHIFT                       16
#define TSI_GENCS_PS(x)                          (((uint32_t)(((uint32_t)(x))<<TSI_GENCS_PS_SHIFT))&TSI_GENCS_PS_MASK)
#define TSI_GENCS_NSCN_MASK                      0xF80000u
#define TSI_GENCS_NSCN_SHIFT                     19
#define TSI_GENCS_NSCN(x)                        (((uint32_t)(((uint32_t)(x))<<TSI_GENCS_NSCN_SHIFT))&TSI_GENCS_NSCN_MASK)
#define TSI_GENCS_LPSCNITV_MASK                  0xF000000u
#define TSI_GENCS_LPSCNITV_SHIFT                 24
#define TSI_GENCS_LPSCNITV(x)                    (((uint32_t)(((uint32_t)(x))<<TSI_GENCS_LPSCNITV_SHIFT))&TSI_GENCS_LPSCNITV_MASK)
#define TSI_GENCS_LPCLKS_MASK                    0x10000000u
#define TSI_GENCS_LPCLKS_SHIFT                   28
/* SCANC Bit Fields */
#define TSI_SCANC_AMPSC_MASK                     0x7u
#define TSI_SCANC_AMPSC_SHIFT                    0
#define TSI_SCANC_AMPSC(x)                       (((uint32_t)(((uint32_t)(x))<<TSI_SCANC_AMPSC_SHIFT))&TSI_SCANC_AMPSC_MASK)
#define TSI_SCANC_AMCLKS_MASK                    0x18u
#define TSI_SCANC_AMCLKS_SHIFT                   3
#define TSI_SCANC_AMCLKS(x)                      (((uint32_t)(((uint32_t)(x))<<TSI_SCANC_AMCLKS_SHIFT))&TSI_SCANC_AMCLKS_MASK)
#define TSI_SCANC_SMOD_MASK                      0xFF00u
#define TSI_SCANC_SMOD_SHIFT                     8
#define TSI_SCANC_SMOD(x)                        (((uint32_t)(((uint32_t)(x))<<TSI_SCANC_SMOD_SHIFT))&TSI_SCANC_SMOD_MASK)
#define TSI_SCANC_EXTCHRG_MASK                   0xF80000u
#define TSI_SCANC_EXTCHRG_SHIFT                  19
#define TSI_SCANC_EXTCHRG(x)                     (((uint32_t)(((uint32_t)(x))<<TSI_SCANC_EXTCHRG_SHIFT))&TSI_SCANC_EXTCHRG_MASK)
#define TSI_SCANC_REFCHRG_MASK                   0xF8000000u
#define TSI_SCANC_REFCHRG_SHIFT                  27
#define TSI_SCANC_REFCHRG(x)                     (((uint32_t)(((uint32_t)(x))<<TSI_SCANC_REFCHRG_SHIFT))&TSI_SCANC_REFCHRG_MASK)
/* PEN Bit Fields */
#define TSI_PEN_PEN0_MASK                        0x1u
#define TSI_PEN_PEN0_SHIFT                       0
#define TSI_PEN_PEN1_MASK                        0x2u
#define TSI_PEN_PEN1_SHIFT                       1
#define TSI_PEN_PEN2_MASK                        0x4u
#define TSI_PEN_PEN2_SHIFT                       2
#define TSI_PEN_PEN3_MASK                        0x8u
#define TSI_PEN_PEN3_SHIFT                       3
#define TSI_PEN_PEN4_MASK                        0x10u
#define TSI_PEN_PEN4_SHIFT                       4
#define TSI_PEN_PEN5_MASK                        0x20u
#define TSI_PEN_PEN5_SHIFT                       5
#define TSI_PEN_PEN6_MASK                        0x40u
#define TSI_PEN_PEN6_SHIFT                       6
#define TSI_PEN_PEN7_MASK                        0x80u
#define TSI_PEN_PEN7_SHIFT                       7
#define TSI_PEN_PEN8_MASK                        0x100u
#define TSI_PEN_PEN8_SHIFT                       8
#define TSI_PEN_PEN9_MASK                        0x200u
#define TSI_PEN_PEN9_SHIFT                       9
#define TSI_PEN_PEN10_MASK                       0x400u
#define TSI_PEN_PEN10_SHIFT                      10
#define TSI_PEN_PEN11_MASK                       0x800u
#define TSI_PEN_PEN11_SHIFT                      11
#define TSI_PEN_PEN12_MASK                       0x1000u
#define TSI_PEN_PEN12_SHIFT                      12
#define TSI_PEN_PEN13_MASK                       0x2000u
#define TSI_PEN_PEN13_SHIFT                      13
#define TSI_PEN_PEN14_MASK                       0x4000u
#define TSI_PEN_PEN14_SHIFT                      14
#define TSI_PEN_PEN15_MASK                       0x8000u
#define TSI_PEN_PEN15_SHIFT                      15
#define TSI_PEN_LPSP_MASK                        0xF0000u
#define TSI_PEN_LPSP_SHIFT                       16
#define TSI_PEN_LPSP(x)                          (((uint32_t)(((uint32_t)(x))<<TSI_PEN_LPSP_SHIFT))&TSI_PEN_LPSP_MASK)
/* WUCNTR Bit Fields */
#define TSI_WUCNTR_WUCNT_MASK                    0xFFFFu
#define TSI_WUCNTR_WUCNT_SHIFT                   0
#define TSI_WUCNTR_WUCNT(x)                      (((uint32_t)(((uint32_t)(x))<<TSI_WUCNTR_WUCNT_SHIFT))&TSI_WUCNTR_WUCNT_MASK)
/* CNTR1 Bit Fields */
#define TSI_CNTR1_CNT_MASK                       0xFFFFFFFFu
#define TSI_CNTR1_CNT_SHIFT                      0
#define TSI_CNTR1_CNT(x)                         (((uint32_t)(((uint32_t)(x))<<TSI_CNTR1_CNT_SHIFT))&TSI_CNTR1_CNT_MASK)
/* CNTR3 Bit Fields */
#define TSI_CNTR3_CNT_MASK                       0xFFFFFFFFu
#define TSI_CNTR3_CNT_SHIFT                      0
#define TSI_CNTR3_CNT(x)                         (((uint32_t)(((uint32_t)(x))<<TSI_CNTR3_CNT_SHIFT))&TSI_CNTR3_CNT_MASK)
/* CNTR5 Bit Fields */
#define TSI_CNTR5_CNT_MASK                       0xFFFFFFFFu
#define TSI_CNTR5_CNT_SHIFT                      0
#define TSI_CNTR5_CNT(x)                         (((uint32_t)(((uint32_t)(x))<<TSI_CNTR5_CNT_SHIFT))&TSI_CNTR5_CNT_MASK)
/* CNTR7 Bit Fields */
#define TSI_CNTR7_CNT_MASK                       0xFFFFFFFFu
#define TSI_CNTR7_CNT_SHIFT                      0
#define TSI_CNTR7_CNT(x)                         (((uint32_t)(((uint32_t)(x))<<TSI_CNTR7_CNT_SHIFT))&TSI_CNTR7_CNT_MASK)
/* CNTR9 Bit Fields */
#define TSI_CNTR9_CNT_MASK                       0xFFFFFFFFu
#define TSI_CNTR9_CNT_SHIFT                      0
#define TSI_CNTR9_CNT(x)                         (((uint32_t)(((uint32_t)(x))<<TSI_CNTR9_CNT_SHIFT))&TSI_CNTR9_CNT_MASK)
/* CNTR11 Bit Fields */
#define TSI_CNTR11_CNT_MASK                      0xFFFFFFFFu
#define TSI_CNTR11_CNT_SHIFT                     0
#define TSI_CNTR11_CNT(x)                        (((uint32_t)(((uint32_t)(x))<<TSI_CNTR11_CNT_SHIFT))&TSI_CNTR11_CNT_MASK)
/* CNTR13 Bit Fields */
#define TSI_CNTR13_CNT_MASK                      0xFFFFFFFFu
#define TSI_CNTR13_CNT_SHIFT                     0
#define TSI_CNTR13_CNT(x)                        (((uint32_t)(((uint32_t)(x))<<TSI_CNTR13_CNT_SHIFT))&TSI_CNTR13_CNT_MASK)
/* CNTR15 Bit Fields */
#define TSI_CNTR15_CNT_MASK                      0xFFFFFFFFu
#define TSI_CNTR15_CNT_SHIFT                     0
#define TSI_CNTR15_CNT(x)                        (((uint32_t)(((uint32_t)(x))<<TSI_CNTR15_CNT_SHIFT))&TSI_CNTR15_CNT_MASK)
/* THRESHLD Bit Fields */
#define TSI_THRESHLD_HTHH_MASK                   0xFFFFu
#define TSI_THRESHLD_HTHH_SHIFT                  0
#define TSI_THRESHLD_HTHH(x)                     (((uint32_t)(((uint32_t)(x))<<TSI_THRESHLD_HTHH_SHIFT))&TSI_THRESHLD_HTHH_MASK)
#define TSI_THRESHLD_LTHH_MASK                   0xFFFF0000u
#define TSI_THRESHLD_LTHH_SHIFT                  16
#define TSI_THRESHLD_LTHH(x)                     (((uint32_t)(((uint32_t)(x))<<TSI_THRESHLD_LTHH_SHIFT))&TSI_THRESHLD_LTHH_MASK)

/*! \} */ /* end of group TSI_Register_Masks */


/* TSI - Peripheral instance base addresses */
/*! Peripheral TSI0 base address */
#define TSI0_BASE                                (0x40045000u)
/*! Peripheral TSI0 base pointer */
#define TSI0                                     ((TSI_Type *)TSI0_BASE)

/*! \} */ /* end of group TSI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- UART Peripheral Access Layer
   ---------------------------------------------------------------------------- */

