elua/elua/src/platform/kinetis/mk60n512md100.h
/*! \} */ /* end of group USB_Register_Masks */


/* USB - Peripheral instance base addresses */
/*! Peripheral USBOTG0 base address */
#define USBOTG0_BASE                             (0x40072000u)
/*! Peripheral USBOTG0 base pointer */
#define USBOTG0                                  ((USB_Type *)USBOTG0_BASE)

/*! \} */ /* end of group USB_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- VREF Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup VREF_Peripheral_Access_Layer VREF Peripheral Access Layer */
/*! \{ */

/*! VREF - Register Layout Typedef */
typedef struct {
  __IO uint8_t TRM;                                /*!< VREF Trim Register, offset: 0x0 */
  __IO uint8_t SC;                                 /*!< VREF Status and Control Register, offset: 0x1 */
} VREF_Type;

/* ----------------------------------------------------------------------------
   -- VREF Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup VREF_Register_Masks VREF Register Masks */
/*! \{ */

/* TRM Bit Fields */
#define VREF_TRM_TRIM_MASK                       0x3Fu
#define VREF_TRM_TRIM_SHIFT                      0
#define VREF_TRM_TRIM(x)                         (((uint8_t)(((uint8_t)(x))<<VREF_TRM_TRIM_SHIFT))&VREF_TRM_TRIM_MASK)
/* SC Bit Fields */
#define VREF_SC_MODE_LV_MASK                     0x3u
#define VREF_SC_MODE_LV_SHIFT                    0
#define VREF_SC_MODE_LV(x)                       (((uint8_t)(((uint8_t)(x))<<VREF_SC_MODE_LV_SHIFT))&VREF_SC_MODE_LV_MASK)
#define VREF_SC_VREFST_MASK                      0x4u
#define VREF_SC_VREFST_SHIFT                     2
#define VREF_SC_REGEN_MASK                       0x40u
#define VREF_SC_REGEN_SHIFT                      6
#define VREF_SC_VREFEN_MASK                      0x80u
#define VREF_SC_VREFEN_SHIFT                     7

/*! \} */ /* end of group VREF_Register_Masks */


/* VREF - Peripheral instance base addresses */
/*! Peripheral VREF base address */
#define VREF_BASE                                (0x40074000u)
/*! Peripheral VREF base pointer */
#define VREF                                     ((VREF_Type *)VREF_BASE)

/*! \} */ /* end of group VREF_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- WDOG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup WDOG_Peripheral_Access_Layer WDOG Peripheral Access Layer */
/*! \{ */

/*! WDOG - Register Layout Typedef */
typedef struct {
  __IO uint16_t STCTRLH;                           /*!< Watchdog Status and Control Register High, offset: 0x0 */
  __IO uint16_t STCTRLL;                           /*!< Watchdog Status and Control Register Low, offset: 0x2 */
  __IO uint16_t TOVALH;                            /*!< Watchdog Time-out Value Register High, offset: 0x4 */
  __IO uint16_t TOVALL;                            /*!< Watchdog Time-out Value Register Low, offset: 0x6 */
  __IO uint16_t WINH;                              /*!< Watchdog Window Register High, offset: 0x8 */
  __IO uint16_t WINL;                              /*!< Watchdog Window Register Low, offset: 0xA */
  __IO uint16_t REFRESH;                           /*!< Watchdog Refresh Register, offset: 0xC */
  __IO uint16_t UNLOCK;                            /*!< Watchdog Unlock Register, offset: 0xE */
  __IO uint16_t TMROUTH;                           /*!< Watchdog Timer Output Register High, offset: 0x10 */
  __IO uint16_t TMROUTL;                           /*!< Watchdog Timer Output Register Low, offset: 0x12 */
  __IO uint16_t RSTCNT;                            /*!< Watchdog Reset Count Register, offset: 0x14 */
  __IO uint16_t PRESC;                             /*!< Watchdog Prescaler Register, offset: 0x16 */
} WDOG_Type;

/* ----------------------------------------------------------------------------
   -- WDOG Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup WDOG_Register_Masks WDOG Register Masks */
/*! \{ */

/* STCTRLH Bit Fields */
#define WDOG_STCTRLH_WDOGEN_MASK                 0x1u
#define WDOG_STCTRLH_WDOGEN_SHIFT                0
#define WDOG_STCTRLH_CLKSRC_MASK                 0x2u
#define WDOG_STCTRLH_CLKSRC_SHIFT                1
#define WDOG_STCTRLH_IRQRSTEN_MASK               0x4u
#define WDOG_STCTRLH_IRQRSTEN_SHIFT              2
#define WDOG_STCTRLH_WINEN_MASK                  0x8u
#define WDOG_STCTRLH_WINEN_SHIFT                 3
#define WDOG_STCTRLH_ALLOWUPDATE_MASK            0x10u
#define WDOG_STCTRLH_ALLOWUPDATE_SHIFT           4
#define WDOG_STCTRLH_DBGEN_MASK                  0x20u
#define WDOG_STCTRLH_DBGEN_SHIFT                 5
#define WDOG_STCTRLH_STOPEN_MASK                 0x40u
#define WDOG_STCTRLH_STOPEN_SHIFT                6
#define WDOG_STCTRLH_WAITEN_MASK                 0x80u
#define WDOG_STCTRLH_WAITEN_SHIFT                7
#define WDOG_STCTRLH_STNDBYEN_MASK               0x100u
#define WDOG_STCTRLH_STNDBYEN_SHIFT              8
#define WDOG_STCTRLH_TESTWDOG_MASK               0x400u
#define WDOG_STCTRLH_TESTWDOG_SHIFT              10
#define WDOG_STCTRLH_TESTSEL_MASK                0x800u
#define WDOG_STCTRLH_TESTSEL_SHIFT               11
#define WDOG_STCTRLH_BYTESEL_MASK                0x3000u
#define WDOG_STCTRLH_BYTESEL_SHIFT               12
#define WDOG_STCTRLH_BYTESEL(x)                  (((uint16_t)(((uint16_t)(x))<<WDOG_STCTRLH_BYTESEL_SHIFT))&WDOG_STCTRLH_BYTESEL_MASK)
#define WDOG_STCTRLH_DISTESTWDOG_MASK            0x4000u
#define WDOG_STCTRLH_DISTESTWDOG_SHIFT           14
/* STCTRLL Bit Fields */
#define WDOG_STCTRLL_INTFLG_MASK                 0x8000u
#define WDOG_STCTRLL_INTFLG_SHIFT                15
/* TOVALH Bit Fields */
#define WDOG_TOVALH_TOVALHIGH_MASK               0xFFFFu
#define WDOG_TOVALH_TOVALHIGH_SHIFT              0
#define WDOG_TOVALH_TOVALHIGH(x)                 (((uint16_t)(((uint16_t)(x))<<WDOG_TOVALH_TOVALHIGH_SHIFT))&WDOG_TOVALH_TOVALHIGH_MASK)
/* TOVALL Bit Fields */
#define WDOG_TOVALL_TOVALLOW_MASK                0xFFFFu
#define WDOG_TOVALL_TOVALLOW_SHIFT               0
#define WDOG_TOVALL_TOVALLOW(x)                  (((uint16_t)(((uint16_t)(x))<<WDOG_TOVALL_TOVALLOW_SHIFT))&WDOG_TOVALL_TOVALLOW_MASK)
/* WINH Bit Fields */
#define WDOG_WINH_WINHIGH_MASK                   0xFFFFu
#define WDOG_WINH_WINHIGH_SHIFT                  0
#define WDOG_WINH_WINHIGH(x)                     (((uint16_t)(((uint16_t)(x))<<WDOG_WINH_WINHIGH_SHIFT))&WDOG_WINH_WINHIGH_MASK)
/* WINL Bit Fields */
#define WDOG_WINL_WINLOW_MASK                    0xFFFFu
#define WDOG_WINL_WINLOW_SHIFT                   0
#define WDOG_WINL_WINLOW(x)                      (((uint16_t)(((uint16_t)(x))<<WDOG_WINL_WINLOW_SHIFT))&WDOG_WINL_WINLOW_MASK)
/* REFRESH Bit Fields */
#define WDOG_REFRESH_WDOGREFRESH_MASK            0xFFFFu
#define WDOG_REFRESH_WDOGREFRESH_SHIFT           0
#define WDOG_REFRESH_WDOGREFRESH(x)              (((uint16_t)(((uint16_t)(x))<<WDOG_REFRESH_WDOGREFRESH_SHIFT))&WDOG_REFRESH_WDOGREFRESH_MASK)
/* UNLOCK Bit Fields */
#define WDOG_UNLOCK_WDOGUNLOCK_MASK              0xFFFFu
#define WDOG_UNLOCK_WDOGUNLOCK_SHIFT             0
#define WDOG_UNLOCK_WDOGUNLOCK(x)                (((uint16_t)(((uint16_t)(x))<<WDOG_UNLOCK_WDOGUNLOCK_SHIFT))&WDOG_UNLOCK_WDOGUNLOCK_MASK)
/* TMROUTH Bit Fields */
#define WDOG_TMROUTH_TIMEROUTHIGH_MASK           0xFFFFu
#define WDOG_TMROUTH_TIMEROUTHIGH_SHIFT          0
#define WDOG_TMROUTH_TIMEROUTHIGH(x)             (((uint16_t)(((uint16_t)(x))<<WDOG_TMROUTH_TIMEROUTHIGH_SHIFT))&WDOG_TMROUTH_TIMEROUTHIGH_MASK)
/* TMROUTL Bit Fields */
#define WDOG_TMROUTL_TIMEROUTLOW_MASK            0xFFFFu
#define WDOG_TMROUTL_TIMEROUTLOW_SHIFT           0
#define WDOG_TMROUTL_TIMEROUTLOW(x)              (((uint16_t)(((uint16_t)(x))<<WDOG_TMROUTL_TIMEROUTLOW_SHIFT))&WDOG_TMROUTL_TIMEROUTLOW_MASK)
/* RSTCNT Bit Fields */
#define WDOG_RSTCNT_RSTCNT_MASK                  0xFFFFu
#define WDOG_RSTCNT_RSTCNT_SHIFT                 0
#define WDOG_RSTCNT_RSTCNT(x)                    (((uint16_t)(((uint16_t)(x))<<WDOG_RSTCNT_RSTCNT_SHIFT))&WDOG_RSTCNT_RSTCNT_MASK)
/* PRESC Bit Fields */
#define WDOG_PRESC_PRESCVAL_MASK                 0x700u
#define WDOG_PRESC_PRESCVAL_SHIFT                8
#define WDOG_PRESC_PRESCVAL(x)                   (((uint16_t)(((uint16_t)(x))<<WDOG_PRESC_PRESCVAL_SHIFT))&WDOG_PRESC_PRESCVAL_MASK)

/*! \} */ /* end of group WDOG_Register_Masks */


/* WDOG - Peripheral instance base addresses */
/*! Peripheral WDOG base address */
#define WDOG_BASE                                (0x40052000u)
/*! Peripheral WDOG base pointer */
#define WDOG                                     ((WDOG_Type *)WDOG_BASE)

/*! \} */ /* end of group WDOG_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup DMA_Peripheral_Access_Layer DMA Peripheral Access Layer */
/*! \{ */

/*! DMA - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR;                                /*!< Control Register, offset: 0x0 */
  __I  uint32_t ES;                                /*!< Error Status Register, offset: 0x4 */
       uint8_t RESERVED_0[4];
  __IO uint32_t ERQ;                               /*!< Enable Request Register, offset: 0xC */
       uint8_t RESERVED_1[4];
  __IO uint32_t EEI;                               /*!< Enable Error Interrupt Register, offset: 0x14 */
  __O  uint8_t CEEI;                               /*!< Clear Enable Error Interrupt Register, offset: 0x18 */
  __O  uint8_t SEEI;                               /*!< Set Enable Error Interrupt Register, offset: 0x19 */
  __O  uint8_t CERQ;                               /*!< Clear Enable Request Register, offset: 0x1A */
  __O  uint8_t SERQ;                               /*!< Set Enable Request Register, offset: 0x1B */
  __O  uint8_t CDNE;                               /*!< Clear DONE Status Bit Register, offset: 0x1C */
  __O  uint8_t SSRT;                               /*!< Set START Bit Register, offset: 0x1D */
  __O  uint8_t CERR;                               /*!< Clear Error Register, offset: 0x1E */
  __O  uint8_t CINT;                               /*!< Clear Interrupt Request Register, offset: 0x1F */
       uint8_t RESERVED_2[4];
  __IO uint32_t INT;                               /*!< Interrupt Request Register, offset: 0x24 */
       uint8_t RESERVED_3[4];
  __IO uint32_t ERR;                               /*!< Error Register, offset: 0x2C */
       uint8_t RESERVED_4[4];
  __IO uint32_t HRS;                               /*!< Hardware Request Status Register, offset: 0x34 */
       uint8_t RESERVED_5[200];
  __IO uint8_t DCHPRI3;                            /*!< Channel n Priority Register, offset: 0x100 */
  __IO uint8_t DCHPRI2;                            /*!< Channel n Priority Register, offset: 0x101 */
  __IO uint8_t DCHPRI1;                            /*!< Channel n Priority Register, offset: 0x102 */
  __IO uint8_t DCHPRI0;                            /*!< Channel n Priority Register, offset: 0x103 */
  __IO uint8_t DCHPRI7;                            /*!< Channel n Priority Register, offset: 0x104 */
  __IO uint8_t DCHPRI6;                            /*!< Channel n Priority Register, offset: 0x105 */
  __IO uint8_t DCHPRI5;                            /*!< Channel n Priority Register, offset: 0x106 */
  __IO uint8_t DCHPRI4;                            /*!< Channel n Priority Register, offset: 0x107 */
  __IO uint8_t DCHPRI11;                           /*!< Channel n Priority Register, offset: 0x108 */
  __IO uint8_t DCHPRI10;                           /*!< Channel n Priority Register, offset: 0x109 */
  __IO uint8_t DCHPRI9;                            /*!< Channel n Priority Register, offset: 0x10A */
  __IO uint8_t DCHPRI8;                            /*!< Channel n Priority Register, offset: 0x10B */
  __IO uint8_t DCHPRI15;                           /*!< Channel n Priority Register, offset: 0x10C */
  __IO uint8_t DCHPRI14;                           /*!< Channel n Priority Register, offset: 0x10D */
  __IO uint8_t DCHPRI13;                           /*!< Channel n Priority Register, offset: 0x10E */
  __IO uint8_t DCHPRI12;                           /*!< Channel n Priority Register, offset: 0x10F */
       uint8_t RESERVED_6[3824];
  struct {                                         /* offset: 0x1000, array step: 0x20 */
    __IO uint32_t SADDR;                             /*!< TCD Source Address, array offset: 0x1000, array step: 0x20 */
    __IO uint16_t SOFF;                              /*!< TCD Signed Source Address Offset, array offset: 0x1004, array step: 0x20 */
    __IO uint16_t ATTR;                              /*!< TCD Transfer Attributes, array offset: 0x1006, array step: 0x20 */
    union {                                          /* offset: 0x1008, array step: 0x20 */
      __IO uint32_t NBYTES_MLNO;                       /*!< TCD Minor Byte Count (Minor Loop Disabled), array offset: 0x1008, array step: 0x20 */
      __IO uint32_t NBYTES_MLOFFNO;                    /*!< TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled), array offset: 0x1008, array step: 0x20 */
      __IO uint32_t NBYTES_MLOFFYES;                   /*!< TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled), array offset: 0x1008, array step: 0x20 */
    };
    __IO uint32_t SLAST;                             /*!< TCD Last Source Address Adjustment, array offset: 0x100C, array step: 0x20 */
    __IO uint32_t DADDR;                             /*!< TCD Destination Address, array offset: 0x1010, array step: 0x20 */
    __IO uint16_t DOFF;                              /*!< TCD Signed Destination Address Offset, array offset: 0x1014, array step: 0x20 */
    union {                                          /* offset: 0x1016, array step: 0x20 */
      __IO uint16_t CITER_ELINKYES;                    /*!< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x1016, array step: 0x20 */
      __IO uint16_t CITER_ELINKNO;                     /*!< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x1016, array step: 0x20 */
    };
    __IO uint32_t DLAST_SGA;                         /*!< TCD Last Destination Address Adjustment/Scatter Gather Address, array offset: 0x1018, array step: 0x20 */
    __IO uint16_t CSR;                               /*!< TCD Control and Status, array offset: 0x101C, array step: 0x20 */
    union {                                          /* offset: 0x101E, array step: 0x20 */
      __IO uint16_t BITER_ELINKNO;                     /*!< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x101E, array step: 0x20 */
      __IO uint16_t BITER_ELINKYES;                    /*!< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x101E, array step: 0x20 */
    };
  } TCD[16];
} DMA_Type;

/* ----------------------------------------------------------------------------
   -- DMA Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup DMA_Register_Masks DMA Register Masks */
/*! \{ */

